{
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Schaltfläche \"Hinzufügen\" zum Panel Pro-Rahmen, Plugin wird nicht angezeigt, ist aber dennoch aktiviert", 
  ">All Locations (written by this plugin)": ">Alle Standorte (von diesem Plugin geschrieben)", 
  ">Alpha value": ">Alpha-Wert", 
  ">Any of these colors can be changed": ">Jede dieser Farben kann geändert werden", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Flag \"Zeitplan\" anwenden (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Attribute Width": ">Attribut Breite", 
  ">Available in v3": ">Verfügbar in v3", 
  ">Blue value": ">Blauer Wert", 
  ">Bundle Targets, base name for each bundle": ">Bundle-Ziele, Basisname für jedes Bundle", 
  ">Color Definitions": ">Farbdefinitionen", 
  ">Color Palett": ">Farbpalette", 
  ">Control Panel": ">Steuertafel", 
  ">Default panel height": ">Standard-Panelhöhe", 
  ">Default panel width": ">Standard-Panelbreite", 
  ">Demonstration at a yard</A>": ">Demonstration auf einer Werft</A>", 
  ">Demonstration at industry</A>": ">Demonstration in der Industrie</A>", 
  ">Destination Track designator": ">Ziel Gleisbezeichner", 
  ">Destination designator": ">Bestimmungskennzeichen", 
  ">Do not edit these": ">Diese nicht bearbeiten", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json. It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": ">Jedes JMRI-Profil erhält eine eigene Konfigurationsdatei mit dem Namen PatternConfig.json, die sich im Ordner operations befindet und dazu dient, benutzerdefinierte Einstellungen für jedes Profil vorzunehmen und Benutzereingaben aufzuzeichnen.", 
  ">Final Destination designator": ">Endzielbezeichnung", 
  ">Final destination Track designator": ">Endziel Gleisbezeichner", 
  ">Green value": ">Grüner Wert", 
  ">Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake. In some cases the plugin might crash. If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point. In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": ">Um die grün markierten Werte wurde eine Art Schutzleiste gelegt, aber auch so kann das Plugin nicht jeden Fehler abfangen. In einigen Fällen kann das Plugin abstürzen. Wenn das passiert, drücken Sie die Schaltfläche \"Restart from PatternConfig Backup\" und das Plugin wird die letzte gute PatternConfig.json-Datei als neuen Ausgangspunkt verwenden. In anderen Fällen, wenn ein Fehler bei der Bearbeitung der PatternConfig.json-Datei gemacht wird, wird das Plugin sie durch die Standarddatei ersetzen und der Benutzer muss von vorne anfangen.", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Hilfe Seite - Pattern Scripts Plugin für JMRI", 
  ">How to add this plugin to JMRI": ">Wie man dieses Plugin zu JMRI hinzufügt", 
  ">How to modify this plugin": ">Wie man dieses Plugin ändert", 
  ">How to set up this plugin</A>": ">So richten Sie dieses Plugin ein</A>", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Track Length Flag ignorieren (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Include this subroutine in the Control Panel": ">Fügen Sie dieses Unterprogramm in die Systemsteuerung ein", 
  ">Introduction": ">Einführung", 
  ">Key": ">Schlüssel", 
  ">May be expanded in v3": ">Kann in v3 erweitert werden", 
  ">No color can be specified with \"\"": ">Mit \"\" kann keine Farbe angegeben werden.", 
  ">Not Implemented": ">Nicht implementiert", 
  ">Organization": ">Organisation", 
  ">Pattern Height": ">Musterhöhe", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (von diesem Plugin geschrieben)", 
  ">Pattern Report for Track Window": ">Musterbericht für Trackfenster", 
  ">Pattern Scripts Subroutine": ">Muster-Skripte Unterroutine", 
  ">Pattern Tracks": ">Pattern Tracks", 
  ">Pattern Width": ">Musterbreite", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (geschrieben von diesem Plugin)", 
  ">Plugin Layout": ">Plugin-Layout", 
  ">Red value": ">Roter Wert", 
  ">Report Modifiers": ">Modifikatoren für Berichte", 
  ">Revision control": ">Revisionskontrolle", 
  ">Row Multiplier": ">Reihenmultiplikator", 
  ">Script Includes": ">Skript Enthält", 
  ">Sort Cars": ">Autos sortieren", 
  ">Sort Locomotives": ">Lokomotiven sortieren", 
  ">The description of each element is in blue": ">Die Beschreibung der einzelnen Elemente ist blau.", 
  ">The following chart shows the code structure of this plugin.": ">Die folgende Tabelle zeigt die Codestruktur dieses Plugins.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file. The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON. All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": ">Die Musterberichte und TrainPlayer©-Exporte beginnen alle mit der Erstellung einer JSON-Datei. Die Datei wird von diesem Plugin erstellt, und im Falle der TrainPlayer©-Manifestexporte wird das JSON durch Modifizierung des von JMRI generierten Manifest-JSON erstellt. Alle JSON-Dateien werden in den Ordner jsonManifests geschrieben. Sie folgen dem abgebildeten Format:", 
  ">These videos are recorded in the English language.": ">Diese Videos sind in englischer Sprache aufgenommen.", 
  ">This program is a plugin for JMRI Operations Pro. With it, the user can generate pattern reports for tracks at a single location. Additionally, cars can be moved from track to track within a location, and optionally, if a car is moved onto a spur, the schedule for that spur can be applied. Support for my TrainPlayer© suite of scripts is also included. The use of this plugin is documented in the following list of videos.": ">Dieses Programm ist ein Plugin für JMRI Operations Pro. Mit ihm kann der Benutzer Musterberichte für Gleise an einem Ort erstellen. Außerdem können Wagen innerhalb eines Ortes von Gleis zu Gleis verschoben werden, und wenn ein Wagen auf eine Abzweigung verschoben wird, kann optional der Fahrplan für diese Abzweigung angewendet werden. Unterstützung für meine TrainPlayer©-Skriptsuite ist ebenfalls enthalten. Die Verwendung dieses Plugins ist in der folgenden Liste von Videos dokumentiert.", 
  ">Track Pattern and Switch List JSON format": ">Track Pattern und Switch List JSON-Format", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Translation Choice": ">Übersetzungsauswahl", 
  ">Translation Services": ">Übersetzungsdienstleistungen", 
  ">Use this plugin with TrainPlayer©": ">Verwenden Sie dieses Plugin mit TrainPlayer©", 
  ">User editable keys are described in green": ">Vom Benutzer bearbeitbare Tasten sind in grüner Farbe beschrieben.", 
  ">Vague Description": ">Vage Beschreibung", 
  ">Video Documentation": ">Video-Dokumentation", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Im schlimmsten Fall löschen Sie einfach die Datei Pattern Config.json, und das Plugin erstellt eine neue Datei.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">Flagge \"Nur Yard Tracks\" (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  "version": 20220101
}