{
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Knop toevoegen aan Panel Pro frame, plugin wordt niet weergegeven maar is wel ingeschakeld", 
  ">All Locations (written by this plugin)": ">Alle Locaties (geschreven door deze plugin)", 
  ">Alpha value": ">Alpha waarde", 
  ">Any of these colors can be changed": ">Elke van deze kleuren kan veranderd worden", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Schema vlag toepassen (ingesteld door gebruiker, geschreven door deze plugin)", 
  ">Attribute Width": ">Attribuut Breedte", 
  ">Available in v3": ">Beschikbaar in v3", 
  ">Blue value": ">Blauwe waarde", 
  ">Bundle Targets, base name for each bundle": ">Bundel Doelen, basisnaam voor elke bundel", 
  ">Color Definitions": ">Kleurdefinities", 
  ">Color Palett": ">Kleuren palet", 
  ">Control Panel": ">Configuratiescherm", 
  ">Default panel height": ">Standaard paneelhoogte", 
  ">Default panel width": ">Standaard paneel breedte", 
  ">Demonstration at a yard</A>": ">Demonstratie op een werf</A>", 
  ">Demonstration at industry</A>": ">Demonstratie bij industrie</A>", 
  ">Destination Track designator": ">Bestemming Spooraanduiding", 
  ">Destination designator": ">Destination designator", 
  ">Do not edit these": ">Bewerk deze niet", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json. It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": ">Elk JMRI profiel krijgt zijn eigen configuratiebestand, dat PatternConfig.json heet. Het bevindt zich in de operations map, en wordt gebruikt om aangepaste instellingen te geven voor elk profiel en om gebruikersinputs vast te leggen.", 
  ">Final Destination designator": ">Definitieve Bestemmingsaanduiding", 
  ">Final destination Track designator": ">Eindbestemming Spooraanduiding", 
  ">Green value": ">Groene waarde", 
  ">Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake. In some cases the plugin might crash. If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point. In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": ">Er zijn beschermingsrails aangebracht rond de groen gemarkeerde waarden, maar zelfs dan nog is deze plugin niet in staat om elk type fout op te vangen. In sommige gevallen kan de plugin crashen. Als dat gebeurt, druk dan op de 'Restart from PatternConfig Backup' knop en de plugin zal het laatste goede PatternConfig.json bestand gebruiken als een nieuw startpunt. In andere gevallen, als er een fout wordt gemaakt bij het bewerken van het PatternConfig.json bestand, zal de plugin het vervangen door het standaard bestand, en zal de gebruiker opnieuw moeten beginnen.", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Helppagina - Pattern Scripts plugin voor JMRI", 
  ">How to add this plugin to JMRI": ">Hoe voeg ik deze plugin toe aan JMRI", 
  ">How to modify this plugin": ">Hoe deze plugin te wijzigen", 
  ">How to set up this plugin</A>": ">Hoe deze plugin in te stellen</A>", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Langspoor vlag negeren (ingesteld door gebruiker, geschreven door deze plugin)", 
  ">Include this subroutine in the Control Panel": ">Inclusief deze subroutine in het configuratiescherm", 
  ">Introduction": ">Inleiding", 
  ">Key": ">Sleutel", 
  ">May be expanded in v3": ">Mag worden uitgebreid in v3", 
  ">No color can be specified with \"\"": ">Er kan geen kleur worden opgegeven met \"\"", 
  ">Not Implemented": ">Niet geïmplementeerd", 
  ">Organization": ">Organisatie", 
  ">Pattern Height": ">Patroon Hoogte", 
  ">Pattern Location (written by this plugin)": ">Patroon locatie (geschreven door deze plugin)", 
  ">Pattern Report for Track Window": ">Patroonrapport voor Spoorvenster", 
  ">Pattern Scripts Subroutine": ">Patroon Scripts Subroutine", 
  ">Pattern Tracks": ">Patroon Sporen", 
  ">Pattern Width": ">Patroon breedte", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (geschreven door deze plugin)", 
  ">Plugin Layout": ">Plugin Layout", 
  ">Red value": ">Rode waarde", 
  ">Report Modifiers": ">Report Modifiers", 
  ">Revision control": ">Revisie controle", 
  ">Row Multiplier": ">Rij vermenigvuldiger", 
  ">Script Includes": ">Script omvat", 
  ">Sort Cars": ">Sorteer auto's", 
  ">Sort Locomotives": ">Sorteer Locomotieven", 
  ">The description of each element is in blue": ">De beschrijving van elk element is in blauw", 
  ">The following chart shows the code structure of this plugin.": ">De volgende grafiek toont de code structuur van deze plugin.", 
  ">The pattern reports and TrainPlayer exports all start with the creation of a JSON file. The file is created by this plugin and in the case of TrainPlayer manifest exports the JSON is created by modifying the JMRI generated manifest JSON. All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": ">De patroon rapporten en TrainPlayer exports beginnen allemaal met de creatie van een JSON bestand. Het bestand wordt gecreëerd door deze plugin en in het geval van TrainPlayer manifest exports wordt de JSON gecreëerd door de JMRI gegenereerde manifest JSON aan te passen. Alle JSON bestanden worden weggeschreven naar de jsonManifests map. Ze volgen het geïllustreerde formaat:", 
  ">These videos are recorded in the English language.": ">Deze video's zijn opgenomen in de Engelse taal.", 
  ">This program is a plugin for JMRI Operations Pro. With it, the user can generate pattern reports for tracks at a single location. Additionally, cars can be moved from track to track within a location, and optionally, if a car is moved onto a spur, the schedule for that spur can be applied. Support for my TrainPlayer suite of scripts is also included. The use of this plugin is documented in the following list of videos.": ">Dit programma is een plugin voor JMRI Operations Pro. Hiermee kan de gebruiker patroonrapporten genereren voor sporen op een enkele locatie. Bovendien kunnen wagens binnen een locatie van spoor naar spoor worden verplaatst, en optioneel, als een wagen naar een zijspoor wordt verplaatst, kan het schema voor dat zijspoor worden toegepast. Ondersteuning voor mijn TrainPlayer suite van scripts is ook inbegrepen. Het gebruik van deze plugin is gedocumenteerd in de volgende lijst van video's.", 
  ">Track Pattern and Switch List JSON format": ">Track Pattern en Switch Lijst JSON formaat", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include vlag (ingesteld door gebruiker, geschreven door deze plugin)", 
  ">Translation Choice": ">Vertaling Keuze", 
  ">Translation Services": ">Vertaaldiensten", 
  ">Use this plugin with TrainPlayer": ">Gebruik deze plugin met TrainPlayer", 
  ">User editable keys are described in green": ">De door de gebruiker bewerkbare toetsen zijn beschreven in groen", 
  ">Vague Description": ">Vage beschrijving", 
  ">Video Documentation": ">Video Documentatie", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">In het slechtste geval, verwijder gewoon het Pattern Config.json bestand en de plugin zal een nieuwe aanmaken.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">Yard Tracks Only vlag (ingesteld door gebruiker, geschreven door deze plugin)", 
  "version": 20220101
}