{
  "Add button to Panel Pro frame, plugin is not displayed but still enabled": "Ajout d'un bouton au cadre de Panel Pro, le plugin n'est pas affiché mais toujours activé", 
  "Additionally, cars can be moved from track to track within a location, and optionally, if a car is moved onto a spur, the schedule for that spur can be applied.": "De plus, les wagons peuvent être déplacés de voie en voie à l'intérieur d'un emplacement et, en option, si un wagon est déplacé sur un embranchement, le programme de cet embranchement peut être appliqué.", 
  "All Locations (written by this plugin)": "Tous les emplacements (écrits par ce plugin)", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Tous les fichiers JSON sont écrits dans le dossier jsonManifests et suivent le format illustré :", 
  "Alpha value": "Valeur alpha", 
  "Any of these colors can be changed": "N'importe laquelle de ces couleurs peut être changée", 
  "Apply Schedule flag (set by user)": "Appliquer le drapeau du calendrier (défini par l'utilisateur)", 
  "Attribute Width": "Largeur de l'attribut", 
  "Available in v3": "Disponible dans la v3", 
  "Blue value": "Valeur bleue", 
  "Color Definations": "Définitions des couleurs", 
  "Color Pallett": "Palette de couleurs", 
  "Default panel height": "Hauteur du panneau par défaut", 
  "Default panel width": "Largeur du panneau par défaut", 
  "Demonstration at a yard": "Démonstration dans un chantier", 
  "Demonstration at industry": "Démonstration dans l'industrie", 
  "Destination Track standin": "Destination Track standin", 
  "Destination standin": "Destination standin", 
  "Do not edit these": "Ne pas modifier ces", 
  "Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": "Chaque profil JMRI reçoit son propre fichier de configuration, nommé PatternConfig.json.", 
  "Final Destination standin": "Le standin de Destination finale", 
  "Final destination Track standin": "Destination finale Track standin", 
  "Green value": "Valeur verte", 
  "Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake that can be made when editing the PatternConfig.json file, and in some cases the plugin might crash.": "Des garde-fous ont été mis en place autour des valeurs marquées en vert, mais même ainsi, ce plugin n'est pas en mesure d'attraper tous les types d'erreurs qui peuvent être faites lors de l'édition du fichier PatternConfig.json, et dans certains cas, le plugin peut planter.", 
  "Help Page - Pattern Scripts plugin for JMRI": "Page d'aide - Plugin Pattern Scripts pour JMRI", 
  "How to add this plugin to JMRI": "Comment ajouter ce plugin à JMRI", 
  "How to modify this plugin": "Comment modifier ce plugin", 
  "How to set up this plugin": "Comment configurer ce plugin", 
  "If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point.": "Dans ce cas, appuyez sur le bouton \"Restart from PatternConfig Backup\" et le plugin utilisera le dernier bon fichier PatternConfig.json comme nouveau point de départ.", 
  "Ignore Track Length flag (set by user)": "Ignorer le drapeau de longueur de piste (défini par l'utilisateur)", 
  "In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": "Dans d'autres cas, si une erreur est commise en modifiant le fichier PatternConfig.json, le plugin le remplacera par le fichier par défaut et l'utilisateur devra recommencer.", 
  "Include this subroutine in the Control Panel": "Incluez ce sous-programme dans le Panneau de configuration.", 
  "Introduction": "Introduction", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Il se trouve dans le dossier des opérations, et est utilisé pour fournir des paramètres personnalisés pour chaque profil et enregistrer les entrées de l'utilisateur.", 
  "Key": "Clé", 
  "May be expanded in v3": "Peut être étendu dans la v3", 
  "No color can be specified with \"\"": "Aucune couleur ne peut être spécifiée avec \"\"", 
  "Not Implemented": "Non mis en œuvre", 
  "Organization": "Organisation", 
  "Pattern Height": "Hauteur du motif", 
  "Pattern Location (written by this plugin)": "Pattern Location (écrit par ce plugin)", 
  "Pattern Report for Track Window": "Rapport sur les motifs de la fenêtre de suivi", 
  "Pattern Scripts Subroutine": "Sous-routine de scripts de motifs", 
  "Pattern Tracks (written by this plugin)": "Pistes de motifs (écrites par ce plugin)", 
  "Pattern Width": "Largeur du motif", 
  "Plugin Layout": "Mise en page du plugin", 
  "Red value": "Valeur rouge", 
  "Revision control": "Contrôle des révisions", 
  "Row Multiplier": "Multiplicateur de rangs", 
  "Script Includes": "Le scénario comprend", 
  "Sort Cars": "Trier les voitures", 
  "Sort Locomotives": "Trier les locomotives", 
  "Support for my TrainPlayer suite of scripts is also included. The use of this plugin is documented in the following list of videos.": "Le support de ma suite de scripts TrainPlayer est également inclus. L'utilisation de ce plugin est documentée dans la liste suivante de vidéos.", 
  "The description of each element is in blue": "La description de chaque élément est en bleu", 
  "The file is created by this plugin and in the case of TrainPlayer manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Le fichier est créé par ce plugin et dans le cas des exportations de manifestes TrainPlayer, le JSON est créé en modifiant le JSON du manifeste généré par JMRI.", 
  "The following chart shows the code structure of this plugin.": "Le tableau suivant montre la structure du code de ce plugin.", 
  "The pattern reports and TrainPlayer exports all start with the creation of a JSON file.": "Les rapports de modèle et les exportations TrainPlayer commencent tous par la création d'un fichier JSON.", 
  "These videio are recorded in the english language.": "Ces vidéos sont enregistrées en langue anglaise.", 
  "This program is a plugin for JMRI Operations Pro. With it, the user can generate pattern reports for tracks at a single location.": "Ce programme est un plugin pour JMRI Operations Pro. Avec lui, l'utilisateur peut générer des rapports de modèle pour les pistes à un seul endroit.", 
  "Track Pattern and Switch List JSON format": "Format JSON pour le modèle de piste et la liste des aiguillages", 
  "Use this plugin with TrainPlayer": "Utilisez ce plugin avec TrainPlayer", 
  "User editable keys are described in green": "Les clés modifiables par l'utilisateur sont décrites en vert", 
  "Vague Description": "Description vague", 
  "Video Documentation": "Documentation vidéo", 
  "Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": "Dans le pire des cas, il suffit de supprimer le fichier Pattern Config.json et le plugin en créera un nouveau.", 
  "Yard Tracks Only flag (set by user)": "Drapeau \"Yard Tracks Only\" (défini par l'utilisateur)", 
  "version": 20220101
}