{
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Ajouter un bouton au cadre de Panel Pro, le plugin n'est pas affiché mais toujours activé", 
  ">All Locations (written by this plugin)": ">Tous les emplacements (écrits par ce plugin)", 
  ">Alpha value": ">Valeur alpha", 
  ">Any of these colors can be changed": ">Chacune de ces couleurs peut être modifiée", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Appliquer le drapeau Schedule (défini par l'utilisateur, écrit par ce plugin)", 
  ">Attribute Width": ">La largeur de l'attribut", 
  ">Available in v3": ">Disponible dans la v3", 
  ">Blue value": ">Valeur bleue", 
  ">Bundle Targets, base name for each bundle": ">Bundle Targets, nom de base pour chaque bundle", 
  ">Color Definitions": ">Définitions des couleurs", 
  ">Color Palett": ">Palette de couleurs", 
  ">Control Panel": ">Panneau de configuration", 
  ">Default panel height": ">Hauteur du panneau par défaut", 
  ">Default panel width": ">Largeur par défaut du panneau", 
  ">Demonstration at a yard</A>": ">Démonstration dans un chantier</A>", 
  ">Demonstration at industry</A>": ">Démonstration à l'industrie</A>", 
  ">Destination Track designator": ">Désignation de la voie de destination", 
  ">Destination designator": ">Désignation de la destination", 
  ">Do not edit these": ">Ne pas modifier ces éléments", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json. It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": ">Chaque profil JMRI dispose de son propre fichier de configuration, appelé PatternConfig.json, qui se trouve dans le dossier des opérations et qui est utilisé pour fournir des paramètres personnalisés pour chaque profil et enregistrer les entrées de l'utilisateur.", 
  ">Final Destination designator": ">Indicateur de destination finale", 
  ">Final destination Track designator": ">Destination finale Indicateur de piste", 
  ">Green value": ">Valeur verte", 
  ">Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake. In some cases the plugin might crash. If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point. In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": ">Des garde-fous ont été mis en place autour des valeurs marquées en vert, mais même ainsi, ce plugin n'est pas capable d'attraper tous les types d'erreurs. Dans certains cas, le plugin peut planter. Si cela se produit, appuyez sur le bouton \"Restart from PatternConfig Backup\" et le plugin utilisera le dernier bon fichier PatternConfig.json comme nouveau point de départ. Dans d'autres cas, si une erreur est faite en modifiant le fichier PatternConfig.json, le plugin le remplacera par le fichier par défaut, et l'utilisateur devra recommencer.", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Page d'aide - Plugin Pattern Scripts pour JMRI", 
  ">How to add this plugin to JMRI": ">Comment ajouter ce plugin à JMRI", 
  ">How to modify this plugin": ">Comment modifier ce plugin", 
  ">How to set up this plugin</A>": ">Comment configurer ce plugin</A>", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Ignorer l'indicateur Track Length (défini par l'utilisateur, écrit par ce plugin)", 
  ">Include this subroutine in the Control Panel": ">Inclure cette sous-routine dans le panneau de contrôle", 
  ">Introduction": ">Introduction", 
  ">Key": ">Key", 
  ">May be expanded in v3": ">Peut être étendu dans la v3", 
  ">No color can be specified with \"\"": ">Aucune couleur ne peut être spécifiée avec \"\".", 
  ">Not Implemented": ">Non mis en œuvre", 
  ">Organization": ">Organisation", 
  ">Pattern Height": ">Hauteur du motif", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (écrit par ce plugin)", 
  ">Pattern Report for Track Window": ">Rapport sur les modèles de la fenêtre de suivi", 
  ">Pattern Scripts Subroutine": ">Sous-routine de scripts de modèle", 
  ">Pattern Tracks": ">Pattern Tracks", 
  ">Pattern Width": ">Largeur du motif", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (écrit par ce plugin)", 
  ">Plugin Layout": ">Plugin Layout", 
  ">Red value": ">Valeur rouge", 
  ">Report Modifiers": ">Modificateurs de rapport", 
  ">Revision control": ">Contrôle de la révision", 
  ">Row Multiplier": ">Multiplicateur de rangs", 
  ">Script Includes": ">Le script comprend", 
  ">Sort Cars": ">Trier les voitures", 
  ">Sort Locomotives": ">Trier les locomotives", 
  ">The description of each element is in blue": ">La description de chaque élément est en bleu", 
  ">The following chart shows the code structure of this plugin.": ">Le tableau suivant montre la structure du code de ce plugin.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file. The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON. All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": ">Les rapports de modèle et les exportations TrainPlayer© commencent tous par la création d'un fichier JSON. Le fichier est créé par ce plugin et dans le cas des exportations du manifeste TrainPlayer©, le JSON est créé en modifiant le JSON du manifeste généré par JMRI. Tous les fichiers JSON sont écrits dans le dossier jsonManifests et suivent le format illustré :", 
  ">These videos are recorded in the English language.": ">Ces vidéos sont enregistrées en langue anglaise.", 
  ">This program is a plugin for JMRI Operations Pro. With it, the user can generate pattern reports for tracks at a single location. Additionally, cars can be moved from track to track within a location, and optionally, if a car is moved onto a spur, the schedule for that spur can be applied. Support for my TrainPlayer© suite of scripts is also included. The use of this plugin is documented in the following list of videos.": ">Ce programme est un plugin pour JMRI Operations Pro. Avec lui, l'utilisateur peut générer des rapports de modèle pour les voies d'un seul emplacement. En outre, les wagons peuvent être déplacés d'une voie à l'autre dans un emplacement, et en option, si un wagon est déplacé sur un embranchement, le programme pour cet embranchement peut être appliqué. Le support pour ma suite de scripts TrainPlayer© est également inclus. L'utilisation de ce plugin est documentée dans la liste suivante de vidéos.", 
  ">Track Pattern and Switch List JSON format": ">Track Pattern et Switch List en format JSON", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (défini par l'utilisateur, écrit par ce plugin)", 
  ">Translation Choice": ">Translation Choice", 
  ">Translation Services": ">Services de traduction", 
  ">Use this plugin with TrainPlayer©": ">Utiliser ce plugin avec TrainPlayer©", 
  ">User editable keys are described in green": ">Les touches modifiables par l'utilisateur sont décrites en vert.", 
  ">Vague Description": ">Vague description", 
  ">Video Documentation": ">Documentation vidéo", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Dans le pire des cas, il suffit de supprimer le fichier Pattern Config.json et le plugin en créera un nouveau.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">drapeau \"Yard Tracks Only\" (défini par l'utilisateur, écrit par ce plugin)", 
  "version": 20220101
}