{
  "<br>Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake. In some cases the plugin might crash. If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point. In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": "<br>Des garde-fous en quelque sorte ont été mis en place autour des valeurs marquées en vert, mais malgré cela, ce plugin n'est pas en mesure d'attraper tous les types d'erreurs. Dans certains cas, le plugin peut planter. Si cela se produit, appuyez sur le bouton \" Restart from PatternConfig Backup \" et le plugin utilisera le dernier bon fichier PatternConfig.json comme nouveau point de départ. Dans d'autres cas, si une erreur est commise en modifiant le fichier PatternConfig.json, le plugin le remplacera par le fichier par défaut, et l'utilisateur devra recommencer.", 
  "<br>Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.</p>": "<br>Dans le pire des cas, il suffit de supprimer le fichier Pattern Config.json et le plugin en créera un nouveau.</p>.", 
  "<font color=\"green\">Report Modifiers</font></h3>": "<font color=\"green\">Modificateurs de rapport</font></h3>.", 
  "<h1>Help Page - Pattern Scripts plugin for JMRI</h1>": "<h1>Page d'aide - plugin Pattern Scripts pour JMRI</h1>", 
  "<h2>Introduction</h2>": "<h2>Introduction</h2>", 
  "<h2>Key": "<h2>Clé", 
  "<h2>Organization</h2>": "<h2>Organisation</h2>", 
  "<h2>Pattern Report for Track Window</h2>": "<h2>Rapport sur les modèles pour la fenêtre de suivi</h2>", 
  "<h2>Pattern Scripts Subroutine</h2>": "<h2>Sous-routine de scripts de modèle</h2>", 
  "<h2>Plugin Layout</h2>": "<h2>Mise en page du plugin</h2>", 
  "<h2>Track Pattern and Switch List JSON format</h2>": "<h2>Modèle de piste et liste d'aiguillage en format JSON</h2>", 
  "<h2>Video Documentation</h2>": "<h2>Documentation vidéo</h2>", 
  "<h3><font color=\"green\">Color Definitions</font></h3>": "<h3><font color=\"green\">Définitions des couleurs</font></h3>.", 
  "<p>Each JMRI profile gets its own configuration file, which is named PatternConfig.json. It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "</p> <p>Chaque profil JMRI obtient son propre fichier de configuration, qui s'appelle PatternConfig.json. Il se trouve dans le dossier des opérations, et est utilisé pour fournir des paramètres personnalisés pour chaque profil et enregistrer les entrées des utilisateurs.", 
  "<p>The following chart shows the code structure of this plugin.</P>": "<p>Le tableau suivant montre la structure du code de ce plugin.</P>", 
  "<p>The pattern reports and TrainPlayer exports all start with the creation of a JSON file. The file is created by this plugin and in the case of TrainPlayer manifest exports the JSON is created by modifying the JMRI generated manifest JSON. All the JSON files are written to the jsonManifests folder. They follow the illustrated format:</p>": "</p> <p>Les rapports de modèle et les exportations TrainPlayer commencent tous par la création d'un fichier JSON. Le fichier est créé par ce plugin et dans le cas des exportations du manifeste TrainPlayer, le JSON est créé en modifiant le JSON du manifeste généré par JMRI. Tous les fichiers JSON sont écrits dans le dossier jsonManifests. Ils suivent le format illustré:</p> <p>", 
  "<p>These videos are recorded in the english language.</p>": "</p> Ces vidéos sont enregistrées en langue anglaise.</p>", 
  "<p>This program is a plugin for JMRI Operations Pro. With it, the user can generate pattern reports for tracks at a single location. Additionally, cars can be moved from track to track within a location, and optionally, if a car is moved onto a spur, the schedule for that spur can be applied. Support for my TrainPlayer suite of scripts is also included. The use of this plugin is documented in the following list of videos.</p>": "<p>Ce programme est un plugin pour JMRI Operations Pro. Avec lui, l'utilisateur peut générer des rapports de motifs pour les voies d'un même emplacement. En outre, les wagons peuvent être déplacés d'une voie à l'autre au sein d'un emplacement et, en option, si un wagon est déplacé sur un embranchement, l'horaire de cet embranchement peut être appliqué. Le support de ma suite de scripts TrainPlayer est également inclus. L'utilisation de ce plugin est documentée dans la liste de vidéos suivante.</p>", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled</font>": ">Ajouter un bouton au cadre de Panel Pro, le plugin n'est pas affiché mais toujours activé</font>.", 
  ">All Locations (written by this plugin)</font>": ">Tous les emplacements (écrits par ce plugin)</font>", 
  ">Alpha value</font>": ">Valeur alpha</font>", 
  ">Any of these colors can be changed</font>": ">Certaines de ces couleurs peuvent être modifiées</font>.", 
  ">Apply Schedule flag (set by user)</font>": ">Appliquer le drapeau du calendrier (défini par l'utilisateur)</font>", 
  ">Attribute Width</font>": "Largeur de l'attribut</font>>.", 
  ">Available in v3</font>": ">Disponible en v3</font>", 
  ">Blue value</font>": ">Valeur bleue</font>", 
  ">Color Palett</font>": "Palette de couleurs</font>>.", 
  ">Control Panel</font></h3>": ">Panneau de configuration</font></h3>.", 
  ">Default panel height</font>": ">Hauteur par défaut du panneau</font>", 
  ">Default panel width</font>": ">La largeur par défaut du panneau</font>", 
  ">Demonstration at a yard</A></p>": ">Démonstration dans un chantier</A></p><p>", 
  ">Demonstration at industry</A></p>": ">Démonstration à l'industrie</A></p>.", 
  ">Destination Track designator</font>": ">Désignation de la voie de destination</font>.", 
  ">Destination designator</font>": ">Désignation de la destination</font>.", 
  ">Do not edit these</font>": ">Ne modifiez pas ces éléments</font>.", 
  ">Final Destination designator</font>": ">Indicateur de destination finale</font>.", 
  ">Final destination Track designator</font>": ">Désignation de la piste de destination finale</font>.", 
  ">Green value</font>": ">Valeur verte</font>", 
  ">How to add this plugin to JMRI</p>": ">Comment ajouter ce plugin à JMRI</p>", 
  ">How to modify this plugin</p>": ">Comment modifier ce plugin</p>", 
  ">How to set up this plugin</A></p>": ">Comment configurer ce plugin</A></p><p>", 
  ">Ignore Track Length flag (set by user)</font>": ">Ignorer le drapeau de longueur de piste (défini par l'utilisateur) </font>", 
  ">Include this subroutine in the Control Panel</font>": ">Inclure ce sous-programme dans le Panneau de configuration</font>>.", 
  ">May be expanded in v3</font>": ">Peut être étendu dans la v3</font>", 
  ">No color can be specified with \"\"</font>": ">Aucune couleur ne peut être spécifiée avec \"\"</font>.", 
  ">Not Implemented</font>": ">Not Implemented</font>", 
  ">Pattern Height</font>": ">Hauteur du motif</font>", 
  ">Pattern Location (written by this plugin)</font>": ">Pattern Location (écrit par ce plugin)</font>", 
  ">Pattern Tracks</font></h3>": ">Pattern Tracks</font></h3>.", 
  ">Pattern Width</font>": ">Largeur du motif</font>", 
  ">Pattern-Tracks (written by this plugin)</font>": ">Pattern-Tracks (écrit par ce plugin)</font>", 
  ">Red value</font>": ">Valeur rouge</font>", 
  ">Revision control</font>": ">Contrôle de la révision</font>", 
  ">Row Multiplier</font>": "Multiplicateur de rangs</font>>.", 
  ">Script Includes</font>": ">Le script comprend</font>", 
  ">Sort Cars</font>": ">Trier les voitures</font>", 
  ">Sort Locomotives</font>": ">Tri des locomotives</font>", 
  ">The description of each element is in blue</font>": ">La description de chaque élément est en bleu</font>.", 
  ">TrainPlayer Include flag (set by user)</font>": ">TrainPlayer Include flag (défini par l'utilisateur)</font>", 
  ">Use this plugin with TrainPlayer</p>": ">Utiliser ce plugin avec TrainPlayer</p>", 
  ">User editable keys are described in green</font>": ">Les touches modifiables par l'utilisateur sont décrites en vert</font>.", 
  ">Vague Description</font>": ">Vague Description</font>", 
  ">Yard Tracks Only flag (set by user)</font>": ">Le drapeau \"Yard Tracks Only\" (défini par l'utilisateur) </font>.", 
  "version": 20220101
}