{
  "  The idea is to expand the capability of TrainPlayer©'s Advanced Ops feature to include the flexibility of Operations Pro,": "L'idea è di espandere le capacità della funzione Advanced Ops di TrainPlayer© per includere la flessibilità di Operations Pro,", 
  "  while also eleminating the tedium of keeping two databases synchronised.": "eliminando al contempo la noia di mantenere sincronizzati due database.", 
  "> Adjustments to operations settings.": "> Regolazioni delle impostazioni operative.", 
  "> Align TrainPlayer and JMRI track types.": "> Allineare i tipi di binari di TrainPlayer e JMRI.", 
  "> JMRI Model Railroad scale.": "> Scala JMRI Model Railroad.", 
  "> Names of the TrainPlayer layout export files.": "> Nomi dei file di esportazione dei layout di TrainPlayer.", 
  ">Activation status": ">Stato di attivazione", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Aggiungi un pulsante alla cornice di Panel Pro, il plugin non viene visualizzato ma è comunque abilitato", 
  ">All locations (written by this plugin)": ">Tutte le posizioni (scritte da questo plugin)", 
  ">Alpha value": ">Valore alfa", 
  ">Any of these colors can be changed": ">Tutti questi colori possono essere modificati", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Applicare il flag Schedule (impostato dall'utente, scritto da questo plugin)", 
  ">Attribute Width": ">Larghezza dell'attributo", 
  ">Blue value": ">Valore blu", 
  ">Build date from TrainPlayer.": ">Data di costruzione da TrainPlayer.", 
  ">Bundle Targets, base name for each bundle": ">Target di bundle, nome di base per ogni bundle", 
  ">Calendar year being modeled.": ">L'anno solare oggetto della modellazione.", 
  ">Color Definitions": ">Definizioni di colore", 
  ">Color Palette": ">Paletta dei colori", 
  ">Control Panel": ">Pannello di controllo", 
  ">Data for this subroutine is entered into the text boxes or if the TrainPlayer subroutine is activated, the additional railroad detail is imported from the TrainPlayer layout.": ">I dati per questa subroutine vengono inseriti nelle caselle di testo o, se la subroutine TrainPlayer è attivata, i dettagli ferroviari aggiuntivi vengono importati dal layout di TrainPlayer.", 
  ">Default encoding": ">Codifica predefinita", 
  ">Default panel height": ">Altezza predefinita del pannello", 
  ">Default panel width": ">Larghezza predefinita del pannello", 
  ">Destination Track designator": ">Designatore del binario di destinazione", 
  ">Destination designator": ">Designatore di destinazione", 
  ">Do not edit these": ">Non modificare questi dati", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": ">Ogni profilo JMRI riceve il proprio file di configurazione, chiamato PatternConfig.json.", 
  ">Final Destination designator": ">Designatore di destinazione finale", 
  ">Final destination Track designator": ">Destinazione finale Indicatore di binario", 
  ">Green value": ">Valore verde", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Pagina di aiuto - Plugin Pattern Scripts per JMRI", 
  ">How to add this plugin to JMRI": ">Come aggiungere questo plugin a JMRI", 
  ">How to modify this plugin": ">Come modificare questo plugin", 
  ">How to set up this plugin</A>": ">Come configurare questo plugin</A>", 
  ">How to translate this plugin": ">Come tradurre questo plugin", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Ignora il flag Lunghezza traccia (impostato dall'utente, scritto da questo plugin)", 
  ">Include list, subroutines are included in this order": ">Lista di inclusione, le subroutine sono incluse in quest'ordine", 
  ">Include this subroutine in the Control Panel": ">Includere questa subroutine nel Pannello di Controllo", 
  ">Introduction": ">Introduzione", 
  ">Key": ">Chiave", 
  ">Layout Name from JMRI Settings": ">Nome del layout dalle impostazioni JMRI", 
  ">Layout name, from settings or TrainPlayer.": ">Nome del layout, dalle impostazioni o da TrainPlayer.", 
  ">List of TrainPlayer caboose car codes.": ">Elenco dei codici dei vagoni di TrainPlayer.", 
  ">List of TrainPlayer car codes for passenger cars.": ">Elenco dei codici macchina di TrainPlayer per le carrozze passeggeri.", 
  ">List of railroad divisions for this layout, comma seperated.": ">Elenco delle divisioni ferroviarie per questo layout, separate da virgole.", 
  ">Location": ">Localizzazione", 
  ">Location of the prototype.": ">Sede del prototipo.", 
  ">Model railroad scale, from settings or TrainPlayer.": ">Scala ferroviaria, dalle impostazioni o da TrainPlayer.", 
  ">Model railroad scale.": ">Scala ferroviaria di modellismo.", 
  ">No color can be specified with \"\"": ">Nessun colore può essere specificato con \"\"", 
  ">Not Implemented": ">Non implementato", 
  ">Not all fields need be entered.": ">Non è necessario inserire tutti i campi.", 
  ">Open System Console Window on starting plugin": ">Apertura della finestra della console di sistema all'avvio del plugin", 
  ">Operating Railroad Name": ">Nome della ferrovia operativa", 
  ">Operating railroad, the one that owns the tracks.": ">Ferrovia operativa, quella che possiede i binari.", 
  ">Operational Territory": ">Territorio operativo", 
  ">Organization": ">Organizzazione", 
  ">Overview of this plugin": ">Panoramica di questo plugin", 
  ">Parent railroad, the one that owns the tracks.": ">Ferrovia madre, quella che possiede i binari.", 
  ">Pattern Height": ">Altezza del modello", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (scritto da questo plugin)", 
  ">Pattern Report for Track Window": ">Rapporto sui modelli per la finestra dei binari", 
  ">Pattern Scripts Subroutine": ">Sottoprogramma Scripts", 
  ">Pattern Scripts plugin": ">Pattern Scripts plugin", 
  ">Pattern Scripts plugin - Video Documentation": ">Plugin Scripts - Documentazione video", 
  ">Pattern Scripts plugin settings in PatternConfig.json": ">Impostazioni del plugin Pattern Scripts in PatternConfig.json", 
  ">Pattern Tracks": ">Tracce del modello", 
  ">Pattern Width": ">Larghezza del modello", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (scritto da questo plugin)", 
  ">Plugin Layout": ">Plugin Layout", 
  ">Railroad Details, optional part of the TrainPlayer layout.": ">Dettagli ferroviari, parte opzionale del layout di TrainPlayer.", 
  ">Red value": ">Valore rosso", 
  ">Report Modifiers": ">Modificatori di rapporto", 
  ">Reserved": ">Riservato", 
  ">Revision control": ">Controllo della revisione", 
  ">Row Multiplier": ">Moltiplicatore di righe", 
  ">Script Includes": ">Lo script include", 
  ">Sort Cars": ">Ordina le auto", 
  ">Sort Locomotives": ">Ordinamento delle locomotive", 
  ">Subroutine Panel": ">Pannello di subroutine", 
  ">Subroutines - Video Documentation": ">Subroutine - Documentazione video", 
  ">Territory. Name of the particular operation being modeled.": ">Nome della particolare operazione che si sta modellando.", 
  ">The Pattern Scripts plugin can be thought of as a framework for hosting subroutines for JMRI Operations Pro that require a user interface.": ">Il plugin Pattern Scripts può essere considerato come una struttura per ospitare le subroutine di JMRI Operations Pro che richiedono un'interfaccia utente.", 
  ">The Pattern Scripts plugin for JMRI is a suite of subroutines for JMRI Operations Pro.": ">Il plugin Pattern Scripts per JMRI è una suite di subroutine per JMRI Operations Pro.", 
  ">The Track Pattern subroutine can generate pattern reports for tracks at a single location.": ">La subroutine Modello di traccia può generare rapporti di modello per le tracce in una singola posizione.", 
  ">The description of each element is in blue": ">La descrizione di ogni elemento è in blu", 
  ">The enhanced fields are as follows:": ">I campi potenziati sono i seguenti:", 
  ">The following chart shows the code structure of this plugin.": ">Il grafico seguente mostra la struttura del codice di questo plugin.", 
  ">The j Plus Subroutine": ">La subroutine j Plus", 
  ">The j Plus subroutine adds enhanced railroad detail to reports generated by both JMRI and this plugin.": ">La subroutine j Plus aggiunge dettagli ferroviari avanzati ai rapporti generati sia da JMRI che da questo plugin.", 
  ">The ops to ops (o2o) subroutine is a group of utilities that are designed to be the glue that allows JMRI Operations Pro to be the operations engine for TrainPlayer©.": ">La subroutine ops to ops (o2o) è un gruppo di utility progettate per essere il collante che consente a JMRI Operations Pro di essere il motore operativo di TrainPlayer©.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file.": ">I rapporti sui modelli e le esportazioni di TrainPlayer© iniziano tutti con la creazione di un file JSON.", 
  ">The table below shows which program manages which elements": ">La tabella seguente mostra quale programma gestisce quali elementi", 
  ">These videos are recorded in the English language.": ">Questi video sono registrati in lingua inglese.", 
  ">This is railroad that owns or operates the tracks being modeled. Any name can be entered such as 'PRR' or 'BN UPRR Joint' or 'G&D'.": ">Può essere inserito qualsiasi nome, ad esempio \"PRR\" o \"BN UPRR Joint\" o \"G&D\".", 
  ">This is the railroad's name for the part being modeled, such as 'Long Beach Intermodal Terminal' or 'Salem Glass Works Branch'.": ">Questo è il nome della ferrovia per la parte da modellare, ad esempio \"Long Beach Intermodal Terminal\" o \"Salem Glass Works Branch\".", 
  ">Track Pattern Subroutine - Demonstration at a yard</A>": ">Subroutine modello di traccia - Dimostrazione in un cantiere</A>", 
  ">Track Pattern Subroutine - Demonstration at industry</A>": ">Subroutine modello di traccia - Dimostrazione all'industria</A>", 
  ">Track Pattern Subroutine Settings in PatternConfig.json": ">Impostazioni della subroutine del modello di tracciamento in PatternConfig.json", 
  ">Track Pattern and Switch List JSON format": ">Schema di traccia ed elenco di interruttori in formato JSON", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (impostato dall'utente, scritto da questo plugin)", 
  ">Translation Services": ">Servizi di traduzione", 
  ">Translation choice": ">Scelta di traduzione", 
  ">Tweek Operations, adjustments to operations settings": ">Operazioni settimanali, regolazioni delle impostazioni operative", 
  ">User editable keys are described in green": ">I tasti modificabili dall'utente sono descritti in verde.", 
  ">Vague Description": ">Descrizione vaga", 
  ">Where the the railroad is located, such as 'The Great Divide' or 'The Bronx, New York'.": ">Dove si trova la ferrovia, ad esempio \"The Great Divide\" o \"The Bronx, New York\".", 
  ">Which year the model railroad is based on, this is a mirror of 'JMRI/OperationsPro/Settings/Year Modeled'.": ">Quale è l'anno su cui si basa il modello di ferrovia, questo è uno specchio di 'JMRI/OperationsPro/Settings/Year Modeled'.", 
  ">Who Does What": ">Chi fa cosa", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Nel caso peggiore, basta cancellare il file Config.json del modello e il plugin ne creerà uno nuovo.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">Bandiera Solo tracce di cantiere (impostata dall'utente, scritta da questo plugin)", 
  ">Year Modeled</h4>": ">Anno modellato</h4>", 
  ">j Plus Subroutine": ">j Subroutine Plus", 
  ">j Plus Subroutine Settings in PatternConfig.json": ">j Impostazioni di subroutine aggiuntive in PatternConfig.json", 
  ">o2o Subroutine Settings in PatternConfig.json": ">o2o Impostazioni della subroutine in PatternConfig.json", 
  ">o2o Subroutine, ops 2 ops": ">o2o Subroutine, ops 2 ops", 
  ">o2o, the ops to ops subroutine for TrainPlayer©": ">o2o, la subroutine da ops a ops per TrainPlayer©", 
  "A template is also included to serve as scaffolding for someone wishing to add their own subroutine.": "È incluso anche un modello che funge da impalcatura per chi desidera aggiungere una propria subroutine.", 
  "Additionally, cars can be moved from track to track within a location.": "Inoltre, le auto possono essere spostate da una pista all'altra all'interno di una località.", 
  "All divisions (written by this plugin)": "Tutte le divisioni (scritte da questo plugin)", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Tutti i file JSON vengono scritti nella cartella jsonManifest e seguono il formato illustrato:", 
  "Although the subroutines are somewhat interdependent, they may be activated or deactivated individually as needed.": "Sebbene le subroutine siano in qualche modo interdipendenti, possono essere attivate o disattivate singolarmente a seconda delle necessità.", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Si trova nella cartella delle operazioni e serve a fornire impostazioni personalizzate per ciascun profilo e a registrare gli input dell'utente.", 
  "Optionally, if a car is moved onto a spur, the schedule for that spur can be applied.": "Facoltativamente, se una macchina viene spostata su una derivazione, è possibile applicare la programmazione per quella derivazione.", 
  "Plugin location, X axis": "Posizione del plugin, asse X", 
  "Plugin location, Y axis": "Posizione del plugin, asse Y", 
  "Specify no color with \"\"": "Non specificare alcun colore con \"\".", 
  "The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Il file viene creato da questo plugin e, nel caso delle esportazioni di manifest di TrainPlayer©, il JSON viene creato modificando il JSON del manifest generato da JMRI.", 
  "The use of this plugin is documented in the following list of videos.": "L'uso di questo plugin è documentato nel seguente elenco di video.", 
  "This plugin comes with three subroutines; j Plus, Pattern Tracks, and o2o.": "Questo plugin è dotato di tre subroutine: j Plus, Pattern Tracks e o2o."
}