{
  "  Additionally, cars can be moved from track to track within a location,": "En outre, les voitures peuvent être déplacées d'une piste à l'autre dans un même lieu,", 
  "  The idea is to expand the capability of TrainPlayer©'s Advanced Ops feature to include the operational flexibility of Operations Pro,": "L'idée est d'étendre les capacités de la fonction Advanced Ops de TrainPlayer© pour y inclure la flexibilité opérationnelle d'Operations Pro,", 
  "  and optionally, if a car is moved onto a spur, the schedule for that spur can be applied.>Track Pattern and Switch List JSON format": "et, en option, si un wagon est déplacé sur un embranchement, le programme de cet embranchement peut être appliqué.>Modèle de voie et liste d'aiguillages au format JSON", 
  "  while also eleminating the tedium of keeping two databases synchronised.": "tout en éliminant l'ennui de maintenir deux bases de données synchronisées.", 
  "> Adjustments to operations settings.": "> Ajustements des paramètres des opérations.", 
  "> Align TrainPlayer and JMRI track types.": "> Aligner les types de voies du TrainPlayer et du JMRI.", 
  "> JMRI Model Railroad scale.": "> JMRI Model Railroad scale.", 
  "> Names of the TrainPlayer layout export files.": "> Noms des fichiers d'exportation de la mise en page de TrainPlayer.", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Ajouter un bouton au cadre de Panel Pro, le plugin n'est pas affiché mais toujours activé", 
  ">All Locations (written by this plugin)": ">Tous les emplacements (écrits par ce plugin)", 
  ">Alpha value": ">Valeur alpha", 
  ">Any of these colors can be changed": ">Chacune de ces couleurs peut être modifiée", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Appliquer le drapeau Schedule (défini par l'utilisateur, écrit par ce plugin)", 
  ">Attribute Width": ">La largeur de l'attribut", 
  ">Blue value": ">Valeur bleue", 
  ">Bundle Targets, base name for each bundle": ">Bundle Targets, nom de base pour chaque bundle", 
  ">Color Definitions": ">Définitions des couleurs", 
  ">Color Palett": ">Palette de couleurs", 
  ">Control Panel": ">Panneau de configuration", 
  ">Default encoding": ">Encodage par défaut", 
  ">Default panel height": ">Hauteur du panneau par défaut", 
  ">Default panel width": ">Largeur par défaut du panneau", 
  ">Destination Track designator": ">Désignation de la voie de destination", 
  ">Destination designator": ">Désignation de la destination", 
  ">Do not edit these": ">Ne pas modifier ces éléments", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": ">Chaque profil JMRI reçoit son propre fichier de configuration, nommé PatternConfig.json.", 
  ">Final Destination designator": ">Indicateur de destination finale", 
  ">Final destination Track designator": ">Destination finale Indicateur de piste", 
  ">Green value": ">Valeur verte", 
  ">Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake.": ">Des garde-fous ont été mis en place autour des valeurs marquées en vert, mais même ainsi, ce plugin n'est pas en mesure de détecter tous les types d'erreurs.", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Page d'aide - Plugin Pattern Scripts pour JMRI", 
  ">How to add this plugin to JMRI": ">Comment ajouter ce plugin à JMRI", 
  ">How to modify this plugin": ">Comment modifier ce plugin", 
  ">How to set up this plugin</A>": ">Comment configurer ce plugin</A>", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Ignorer l'indicateur Track Length (défini par l'utilisateur, écrit par ce plugin)", 
  ">Include this subroutine in the Control Panel": ">Inclure cette sous-routine dans le panneau de contrôle", 
  ">Introduction": ">Introduction", 
  ">Key": ">Key", 
  ">List of TrainPlayer caboose car codes.": ">Liste des codes des wagons de queue de TrainPlayer.", 
  ">List of TrainPlayer car codes for passenger cars.": ">Liste des codes de wagons TrainPlayer pour les voitures particulières.", 
  ">No color can be specified with \"\"": ">Aucune couleur ne peut être spécifiée avec \"\".", 
  ">Not Implemented": ">Non mis en œuvre", 
  ">Organization": ">Organisation", 
  ">Pattern Height": ">Hauteur du motif", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (écrit par ce plugin)", 
  ">Pattern Report for Track Window": ">Rapport sur les modèles de la fenêtre de suivi", 
  ">Pattern Scripts Subroutine": ">Sous-routine de scripts de modèle", 
  ">Pattern Tracks": ">Pattern Tracks", 
  ">Pattern Width": ">Largeur du motif", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (écrit par ce plugin)", 
  ">Plugin Layout": ">Plugin Layout", 
  ">Red value": ">Valeur rouge", 
  ">Report Modifiers": ">Modificateurs de rapport", 
  ">Revision control": ">Contrôle de la révision", 
  ">Row Multiplier": ">Multiplicateur de rangs", 
  ">Script Includes": ">Le script comprend", 
  ">Selecting subroutines": ">Sélectionner les sous-routines", 
  ">Sort Cars": ">Trier les voitures", 
  ">Sort Locomotives": ">Trier les locomotives", 
  ">The Pattern Scripts plugin for JMRI is a suite of subroutines for JMRI Operations Pro.  The use of this plugin is documented in the following list of videos.": ">Le plugin Pattern Scripts pour JMRI est une suite de sous-programmes pour JMRI Operations Pro. L'utilisation de ce plugin est documentée dans la liste de vidéos suivante.", 
  ">The Track Pattern subroutine can generate pattern reports for tracks at a single location.": ">La sous-routine Track Pattern permet de générer des rapports de motifs pour les pistes à un seul endroit.", 
  ">The description of each element is in blue": ">La description de chaque élément est en bleu", 
  ">The following chart shows the code structure of this plugin.": ">Le tableau suivant montre la structure du code de ce plugin.", 
  ">The ops to ops (o2o) subroutine is a group of utilities that are designed to be the glue that allows JMRI Operations Pro to be the operations engine for TrainPlayer©.": ">La sous-routine ops to ops (o2o) est un groupe d'utilitaires conçus pour être la colle qui permet à JMRI Operations Pro d'être le moteur d'opérations de TrainPlayer©.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file.": ">Les rapports de modèle et les exportations TrainPlayer© commencent tous par la création d'un fichier JSON.", 
  ">These videos are recorded in the English language.": ">Ces vidéos sont enregistrées en langue anglaise.", 
  ">Track Pattern Subroutine - Demonstration at a yard</A>": ">Subroutine de modèle de piste - Démonstration sur un chantier</A>", 
  ">Track Pattern Subroutine - Demonstration at industry</A>": ">Subroutine Track Pattern - Démonstration à l'industrie</A>", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (défini par l'utilisateur, écrit par ce plugin)", 
  ">Translation Choice": ">Translation Choice", 
  ">Translation Services": ">Services de traduction", 
  ">User editable keys are described in green": ">Les touches modifiables par l'utilisateur sont décrites en vert.", 
  ">Vague Description": ">Description vague", 
  ">Video Documentation": ">Documentation vidéo", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Dans le pire des cas, il suffit de supprimer le fichier Pattern Config.json et le plugin en créera un nouveau.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">drapeau \"Yard Tracks Only\" (défini par l'utilisateur, écrit par ce plugin)", 
  ">o2o Subroutine, ops 2 ops": ">o2o Sous-routine, ops 2 ops", 
  ">o2o, the ops to ops subroutine for TrainPlayer©": ">o2o, la sous-routine ops to ops pour TrainPlayer©", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Tous les fichiers JSON sont écrits dans le dossier jsonManifests et suivent le format illustré :", 
  "In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": "Dans d'autres cas, si une erreur est commise en modifiant le fichier PatternConfig.json, le plugin le remplacera par le fichier par défaut et l'utilisateur devra recommencer.", 
  "In some cases the plugin might crash. If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point.": "Si cela se produit, appuyez sur le bouton \"Restart from PatternConfig Backup\" (redémarrer à partir de la sauvegarde de PatternConfig) et le plugin utilisera le dernier bon fichier PatternConfig.json comme nouveau point de départ.", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Il se trouve dans le dossier des opérations, et est utilisé pour fournir des paramètres personnalisés pour chaque profil et enregistrer les entrées de l'utilisateur.", 
  "The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Le fichier est créé par ce plugin et dans le cas des exportations de manifestes TrainPlayer©, le JSON est créé en modifiant le JSON du manifeste généré par JMRI."
}