{
  "  The idea is to expand the capability of TrainPlayer©'s Advanced Ops feature to include the flexibility of Operations Pro,": "L'idée est d'étendre les capacités de la fonction Advanced Ops de TrainPlayer© pour y inclure la flexibilité d'Operations Pro,", 
  "  while also eleminating the tedium of keeping two databases synchronised.": "tout en éliminant l'ennui de maintenir deux bases de données synchronisées.", 
  "> Adjustments to operations settings.": "> Ajustements des paramètres des opérations.", 
  "> Align TrainPlayer and JMRI track types.": "> Aligner les types de voies du TrainPlayer et du JMRI.", 
  "> JMRI Model Railroad scale.": "> JMRI Model Railroad scale.", 
  "> Names of the TrainPlayer layout export files.": "> Noms des fichiers d'exportation de la mise en page de TrainPlayer.", 
  ">Activation status": ">Statut d'activation", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Ajouter un bouton au cadre de Panel Pro, le plugin n'est pas affiché mais toujours activé", 
  ">All locations (written by this plugin)": ">Tous les emplacements (écrits par ce plugin)", 
  ">Alpha value": ">Valeur alpha", 
  ">Any of these colors can be changed": ">Chacune de ces couleurs peut être modifiée", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Appliquer le drapeau Schedule (défini par l'utilisateur, écrit par ce plugin)", 
  ">Attribute Width": ">La largeur de l'attribut", 
  ">Blue value": ">Valeur bleue", 
  ">Build date from TrainPlayer.": ">Date de construction de TrainPlayer.", 
  ">Bundle Targets, base name for each bundle": ">Bundle Targets, nom de base pour chaque bundle", 
  ">Calendar year being modeled.": ">Année civile faisant l'objet du modèle.", 
  ">Color Definitions": ">Définitions des couleurs", 
  ">Color Palette": ">Palette de couleurs", 
  ">Control Panel": ">Panneau de configuration", 
  ">Data for this subroutine is entered into the text boxes or if the TrainPlayer subroutine is activated, the additional railroad detail is imported from the TrainPlayer layout.": ">Les données de cette sous-routine sont saisies dans les zones de texte ou, si la sous-routine TrainPlayer est activée, les détails supplémentaires sur les chemins de fer sont importés à partir du modèle TrainPlayer.", 
  ">Default encoding": ">Encodage par défaut", 
  ">Default panel height": ">Hauteur du panneau par défaut", 
  ">Default panel width": ">Largeur par défaut du panneau", 
  ">Destination Track designator": ">Désignation de la voie de destination", 
  ">Destination designator": ">Désignation de la destination", 
  ">Do not edit these": ">Ne pas modifier ces éléments", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": ">Chaque profil JMRI obtient son propre fichier de configuration, nommé PatternConfig.json.", 
  ">Final Destination designator": ">Indicateur de destination finale", 
  ">Final destination Track designator": ">Destination finale Indicateur de piste", 
  ">Green value": ">Valeur verte", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Page d'aide - Plugin Pattern Scripts pour JMRI", 
  ">How to add this plugin to JMRI": ">Comment ajouter ce plugin à JMRI", 
  ">How to modify this plugin": ">Comment modifier ce plugin", 
  ">How to set up this plugin</A>": ">Comment configurer ce plugin</A>", 
  ">How to translate this plugin": ">Comment traduire ce plugin", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Ignorer l'indicateur Track Length (défini par l'utilisateur, écrit par ce plugin)", 
  ">Include list, subroutines are included in this order": ">Liste d'inclusion, les sous-routines sont incluses dans cet ordre", 
  ">Include this subroutine in the Control Panel": ">Inclure cette sous-routine dans le panneau de contrôle", 
  ">Introduction": ">Introduction", 
  ">Key": ">Key", 
  ">Layout Name from JMRI Settings": ">Nom de la mise en page à partir des paramètres JMRI", 
  ">Layout name, from settings or TrainPlayer.": ">Nom de la maquette, à partir des paramètres ou de TrainPlayer.", 
  ">List of TrainPlayer caboose car codes.": ">Liste des codes des wagons de queue de TrainPlayer.", 
  ">List of TrainPlayer car codes for passenger cars.": ">Liste des codes de wagons TrainPlayer pour les voitures particulières.", 
  ">List of railroad divisions for this layout, comma seperated.": ">Liste des divisions ferroviaires pour ce réseau, séparées par des virgules.", 
  ">Location": ">Localisation", 
  ">Location of the prototype.": ">L'emplacement du prototype.", 
  ">Model railroad scale, from settings or TrainPlayer.": ">Échelle de modélisme ferroviaire, à partir des paramètres ou de TrainPlayer.", 
  ">Model railroad scale.": ">Échelle de modélisme ferroviaire.", 
  ">No color can be specified with \"\"": ">Aucune couleur ne peut être spécifiée avec \"\".", 
  ">Not Implemented": ">Non mis en œuvre", 
  ">Not all fields need be entered.": ">Il n'est pas nécessaire de remplir tous les champs.", 
  ">Open System Console Window on starting plugin": ">Ouvrir la fenêtre de la console système au démarrage du plugin", 
  ">Operating Railroad Name": ">Nom du chemin de fer en activité", 
  ">Operating railroad, the one that owns the tracks.": ">Chemin de fer opérationnel, celui qui possède les voies.", 
  ">Operational Territory": ">Territoire opérationnel", 
  ">Organization": ">Organisation", 
  ">Overview of this plugin": ">Visualisation de ce plugin", 
  ">Parent railroad, the one that owns the tracks.": ">Parent chemin de fer, celui qui possède les voies.", 
  ">Pattern Height": ">Hauteur du motif", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (écrit par ce plugin)", 
  ">Pattern Report for Track Window": ">Rapport sur les modèles de la fenêtre de suivi", 
  ">Pattern Scripts Subroutine": ">Sous-routine de scripts de modèle", 
  ">Pattern Scripts plugin": ">Plugin Scripts de motifs", 
  ">Pattern Scripts plugin - Video Documentation": ">Pattern Scripts plugin - Documentation vidéo", 
  ">Pattern Scripts plugin settings in PatternConfig.json": ">Les paramètres du plugin Pattern Scripts dans PatternConfig.json", 
  ">Pattern Tracks": ">Pattern Tracks", 
  ">Pattern Width": ">Largeur du motif", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (écrit par ce plugin)", 
  ">Plugin Layout": ">Plugin Layout", 
  ">Railroad Details, optional part of the TrainPlayer layout.": ">Détails ferroviaires, partie facultative de la mise en page TrainPlayer.", 
  ">Red value": ">Valeur rouge", 
  ">Report Modifiers": ">Modificateurs de rapport", 
  ">Reserved": ">Réservé", 
  ">Revision control": ">Contrôle de la révision", 
  ">Row Multiplier": ">Multiplicateur de rangs", 
  ">Script Includes": ">Le script comprend", 
  ">Sort Cars": ">Trier les voitures", 
  ">Sort Locomotives": ">Trier les locomotives", 
  ">Subroutine Panel": ">Subroutine Panel", 
  ">Subroutines - Video Documentation": ">Sous-routines - Documentation vidéo", 
  ">Territory. Name of the particular operation being modeled.": ">Nom de l'opération particulière qui est modélisée.", 
  ">The Pattern Scripts plugin can be thought of as a framework for hosting subroutines for JMRI Operations Pro that require a user interface.": ">Le plugin Pattern Scripts peut être considéré comme un cadre permettant d'héberger des sous-programmes pour JMRI Operations Pro qui nécessitent une interface utilisateur.", 
  ">The Pattern Scripts plugin for JMRI is a suite of subroutines for JMRI Operations Pro.": ">Le plugin Pattern Scripts pour JMRI est une suite de sous-programmes pour JMRI Operations Pro.", 
  ">The Track Pattern subroutine can generate pattern reports for tracks at a single location.": ">La sous-routine Track Pattern permet de générer des rapports de motifs pour les pistes à un seul endroit.", 
  ">The description of each element is in blue": ">La description de chaque élément est en bleu", 
  ">The enhanced fields are as follows:": ">Les champs améliorés sont les suivants :", 
  ">The following chart shows the code structure of this plugin.": ">Le tableau suivant montre la structure du code de ce plugin.", 
  ">The j Plus Subroutine": ">Le sous-programme j plus", 
  ">The j Plus subroutine adds enhanced railroad detail to reports generated by both JMRI and this plugin.": ">Le sous-programme j Plus ajoute des détails ferroviaires améliorés aux rapports générés par JMRI et ce plugin.", 
  ">The ops to ops (o2o) subroutine is a group of utilities that are designed to be the glue that allows JMRI Operations Pro to be the operations engine for TrainPlayer©.": ">La sous-routine ops to ops (o2o) est un groupe d'utilitaires conçus pour être la colle qui permet à JMRI Operations Pro d'être le moteur d'opérations de TrainPlayer©.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file.": ">Les rapports de modèle et les exportations TrainPlayer© commencent tous par la création d'un fichier JSON.", 
  ">The table below shows which program manages which elements": ">Le tableau ci-dessous indique quel programme gère quels éléments", 
  ">These videos are recorded in the English language.": ">Ces vidéos sont enregistrées en langue anglaise.", 
  ">This is railroad that owns or operates the tracks being modeled. Any name can be entered such as 'PRR' or 'BN UPRR Joint' or 'G&D'.": ">Il s'agit du chemin de fer qui possède ou exploite les voies modélisées. N'importe quel nom peut être saisi, tel que 'PRR' ou 'BN UPRR Joint' ou 'G&D'.", 
  ">This is the railroad's name for the part being modeled, such as 'Long Beach Intermodal Terminal' or 'Salem Glass Works Branch'.": ">Il s'agit du nom du chemin de fer pour la partie modélisée, par exemple \"Long Beach Intermodal Terminal\" ou \"Salem Glass Works Branch\".", 
  ">Track Pattern Subroutine - Demonstration at a yard</A>": ">Subroutine de modèle de piste - Démonstration sur un chantier</A>", 
  ">Track Pattern Subroutine - Demonstration at industry</A>": ">Subroutine Track Pattern - Démonstration à l'industrie</A>", 
  ">Track Pattern Subroutine Settings in PatternConfig.json": ">Suivre les paramètres des sous-programmes de motifs dans PatternConfig.json", 
  ">Track Pattern and Switch List JSON format": ">Track Pattern et Switch List en format JSON", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (défini par l'utilisateur, écrit par ce plugin)", 
  ">Translation Services": ">Services de traduction", 
  ">Translation choice": ">Choix de la traduction", 
  ">Tweek Operations, adjustments to operations settings": ">Opérations de la semaine, ajustements des paramètres des opérations", 
  ">User editable keys are described in green": ">Les touches modifiables par l'utilisateur sont décrites en vert.", 
  ">Vague Description": ">Description vague", 
  ">Where the the railroad is located, such as 'The Great Divide' or 'The Bronx, New York'.": ">L'endroit où se trouve le chemin de fer, par exemple \"The Great Divide\" ou \"The Bronx, New York\".", 
  ">Which year the model railroad is based on, this is a mirror of 'JMRI/OperationsPro/Settings/Year Modeled'.": ">L'année sur laquelle le modèle ferroviaire est basé, c'est un miroir de 'JMRI/OperationsPro/Settings/Year Modeled'.", 
  ">Who Does What": ">Qui fait quoi", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Dans le pire des cas, il suffit de supprimer le fichier Pattern Config.json et le plugin en créera un nouveau.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">drapeau \"Yard Tracks Only\" (défini par l'utilisateur, écrit par ce plugin)", 
  ">Year Modeled</h4>": ">Année modélisée</h4>", 
  ">j Plus Subroutine": ">j Plus Subroutine", 
  ">j Plus Subroutine Settings in PatternConfig.json": ">j Plus Paramètres des sous-routines dans PatternConfig.json", 
  ">o2o Subroutine Settings in PatternConfig.json": ">o2o Paramètres des sous-routines dans PatternConfig.json", 
  ">o2o Subroutine, ops 2 ops": ">o2o Sous-routine, ops 2 ops", 
  ">o2o, the ops to ops subroutine for TrainPlayer©": ">o2o, la sous-routine ops to ops pour TrainPlayer©", 
  "A template is also included to serve as scaffolding for someone wishing to add their own subroutine.": "Un modèle est également inclus pour servir d'échafaudage à une personne souhaitant ajouter son propre sous-programme.", 
  "Additionally, cars can be moved from track to track within a location.": "En outre, les voitures peuvent être déplacées d'une piste à l'autre dans un même lieu.", 
  "All divisions (written by this plugin)": "Toutes les divisions (écrites par ce plugin)", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Tous les fichiers JSON sont écrits dans le dossier jsonManifests et suivent le format illustré :", 
  "Although the subroutines are somewhat interdependent, they may be activated or deactivated individually as needed.": "Bien que les sous-routines soient quelque peu interdépendantes, elles peuvent être activées ou désactivées individuellement selon les besoins.", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Il se trouve dans le dossier des opérations, et est utilisé pour fournir des paramètres personnalisés pour chaque profil et enregistrer les entrées de l'utilisateur.", 
  "Optionally, if a car is moved onto a spur, the schedule for that spur can be applied.": "En option, si une voiture est déplacée sur un embranchement, l'horaire de cet embranchement peut être appliqué.", 
  "Plugin location, X axis": "Emplacement du plugin, axe X", 
  "Plugin location, Y axis": "Emplacement du plugin, axe Y", 
  "Specify no color with \"\"": "Ne spécifiez aucune couleur avec \"\"", 
  "The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Le fichier est créé par ce plugin et dans le cas des exportations de manifestes TrainPlayer©, le JSON est créé en modifiant le JSON du manifeste généré par JMRI.", 
  "The use of this plugin is documented in the following list of videos.": "L'utilisation de ce plugin est documentée dans la liste suivante de vidéos.", 
  "This plugin comes with three subroutines; j Plus, Pattern Tracks, and o2o.": "Ce plugin est livré avec trois sous-programmes : j Plus, Pattern Tracks et o2o."
}