{
  "  The idea is to expand the capability of TrainPlayer©'s Advanced Ops feature to include the flexibility of Operations Pro,": "Ideen er at udvide TrainPlayer©'s Advanced Ops-funktion til at omfatte fleksibiliteten i Operations Pro,", 
  "  while also eleminating the tedium of keeping two databases synchronised.": "samtidig med, at det er slut med at holde to databaser synkroniserede.", 
  "> Adjustments to operations settings.": "> Justeringer af indstillinger for drift.", 
  "> Align TrainPlayer and JMRI track types.": "> Juster TrainPlayer- og JMRI-sporetyper.", 
  "> JMRI Model Railroad scale.": "> JMRI Model Railroad skala.", 
  "> Names of the TrainPlayer layout export files.": "> Navne på TrainPlayer-layouteksportfilerne.", 
  ">Activation status": ">Aktiveringsstatus", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": "> Tilføj knap til Panel Pro-rammen, plugin vises ikke, men er stadig aktiveret", 
  ">All locations (written by this plugin)": ">Alle steder (skrevet af dette plugin)", 
  ">Alpha value": ">Alpha-værdi", 
  ">Any of these colors can be changed": ">Alle disse farver kan ændres", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Apply Schedule-flag (indstillet af brugeren, skrevet af dette plugin)", 
  ">Attribute Width": ">Bredde af attributter", 
  ">Blue value": ">Blå værdi", 
  ">Build date from TrainPlayer.": ">Bygningsdato fra TrainPlayer.", 
  ">Bundle Targets, base name for each bundle": ">Bundle Targets, basisnavn for hvert bundle", 
  ">Calendar year being modeled.": ">Kalenderår, der er genstand for modelberegningen.", 
  ">Color Definitions": ">Farvedefinitioner", 
  ">Color Palette": ">Farvepalet", 
  ">Control Panel": ">Kontrolpanel", 
  ">Data for this subroutine is entered into the text boxes or if the TrainPlayer subroutine is activated, the additional railroad detail is imported from the TrainPlayer layout.": ">Data til denne underrutine indtastes i tekstfelterne, eller hvis TrainPlayer-underrutinen er aktiveret, importeres de yderligere jernbanedetaljer fra TrainPlayer-layoutet.", 
  ">Default encoding": "> Standardkodning", 
  ">Default panel height": ">Standardhøjde for panelet", 
  ">Default panel width": "> Standardpanelets bredde", 
  ">Destination Track designator": ">Destination Track-betegnelse", 
  ">Destination designator": ">Destinationskendetegn", 
  ">Do not edit these": ">Du må ikke redigere disse", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": ">Hver JMRI-profil får sin egen konfigurationsfil, som hedder PatternConfig.json.", 
  ">Final Destination designator": ">Angiver den endelige destination", 
  ">Final destination Track designator": ">Endelig destination Sporbetegnelse", 
  ">Green value": ">Grøn værdi", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Hjælpsside - Pattern Scripts plugin til JMRI", 
  ">How to add this plugin to JMRI": ">Sådan tilføjer du dette plugin til JMRI", 
  ">How to modify this plugin": ">Sådan ændrer du dette plugin", 
  ">How to set up this plugin</A>": ">Sådan konfigurerer du dette plugin</A>", 
  ">How to translate this plugin": ">Hvordan man oversætter dette plugin", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Ignorer Track Length flag (indstillet af brugeren, skrevet af dette plugin)", 
  ">Include list, subroutines are included in this order": ">Inkluderer liste, underprogrammer inkluderes i denne rækkefølge", 
  ">Include this subroutine in the Control Panel": ">Inkluder denne underrutine i kontrolpanelet", 
  ">Introduction": ">Introduktion", 
  ">Key": ">Nøgle", 
  ">Layout Name from JMRI Settings": ">Layoutnavn fra JMRI-indstillinger", 
  ">Layout name, from settings or TrainPlayer.": ">Layoutnavn, fra indstillinger eller TrainPlayer.", 
  ">List of TrainPlayer caboose car codes.": ">Liste over TrainPlayers koder for kupevogne.", 
  ">List of TrainPlayer car codes for passenger cars.": ">Liste over TrainPlayer-bilkoder for personvogne.", 
  ">List of railroad divisions for this layout, comma seperated.": ">Liste over jernbanedivisioner for dette layout, adskilt med kommaer.", 
  ">Location": ">Sted", 
  ">Location of the prototype.": ">Stedet for prototypen.", 
  ">Model railroad scale, from settings or TrainPlayer.": ">Modeljernbaneskala, fra indstillinger eller TrainPlayer.", 
  ">Model railroad scale.": ">Modeljernbane skala.", 
  ">No color can be specified with \"\"": ">Ingen farve kan angives med \"\"", 
  ">Not Implemented": ">ikke implementeret", 
  ">Not all fields need be entered.": ">Det er ikke nødvendigt at udfylde alle felter.", 
  ">Open System Console Window on starting plugin": ">Åbne systemkonsolvindue ved start af plugin", 
  ">Operating Railroad Name": "> Navn på den fungerende jernbane", 
  ">Operating railroad, the one that owns the tracks.": ">Driftsførende jernbane, den, der ejer sporene.", 
  ">Operational Territory": ">Operationelt område", 
  ">Organization": ">Organisation", 
  ">Overview of this plugin": ">Oversigt over dette plugin", 
  ">Parent railroad, the one that owns the tracks.": ">Moderbaneselskab, det selskab, der ejer sporene.", 
  ">Pattern Height": ">Mønsterhøjde", 
  ">Pattern Location (written by this plugin)": ">Mønsterplacering (skrevet af dette plugin)", 
  ">Pattern Report for Track Window": ">Mønsterrapport for sporvindue", 
  ">Pattern Scripts Subroutine": ">Mønsterskripter Underrutine", 
  ">Pattern Scripts plugin": ">Pattern Scripts plugin", 
  ">Pattern Scripts plugin - Video Documentation": ">Pattern Scripts plugin - Videodokumentation", 
  ">Pattern Scripts plugin settings in PatternConfig.json": ">Mønster Scripts plugin-indstillinger i PatternConfig.json", 
  ">Pattern Tracks": ">Mønsterspor", 
  ">Pattern Width": ">Bredde af mønster", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (skrevet af dette plugin)", 
  ">Plugin Layout": ">Plugin-layout", 
  ">Railroad Details, optional part of the TrainPlayer layout.": ">Railroad Details, valgfri del af TrainPlayer-layoutet.", 
  ">Red value": ">Rød værdi", 
  ">Report Modifiers": ">Rapportere modifikatorer", 
  ">Reserved": ">Reserveret", 
  ">Revision control": ">Revisionskontrol", 
  ">Row Multiplier": ">Række-multiplikator", 
  ">Script Includes": ">Script indeholder", 
  ">Sort Cars": ">Sortere biler", 
  ">Sort Locomotives": ">Sortere lokomotiver", 
  ">Subroutine Panel": ">Panel med underrutiner", 
  ">Subroutines - Video Documentation": ">Subrutiner - Videodokumentation", 
  ">Territory. Name of the particular operation being modeled.": ">Territorium: Navn på den særlige operation, der modelleres.", 
  ">The Pattern Scripts plugin can be thought of as a framework for hosting subroutines for JMRI Operations Pro that require a user interface.": ">Pluginprogrammet Pattern Scripts kan betragtes som en ramme for hosting af underrutiner til JMRI Operations Pro, der kræver en brugergrænseflade.", 
  ">The Pattern Scripts plugin for JMRI is a suite of subroutines for JMRI Operations Pro.": ">Mønsterscripts-plugin til JMRI er en række underrutiner til JMRI Operations Pro.", 
  ">The Track Pattern subroutine can generate pattern reports for tracks at a single location.": ">Spormønsterunderrutinen kan generere mønsterrapporter for spor på et enkelt sted.", 
  ">The description of each element is in blue": ">Beskrivelsen af hvert element er med blå skrift", 
  ">The enhanced fields are as follows:": ">De forbedrede felter er som følger:", 
  ">The following chart shows the code structure of this plugin.": ">Den følgende oversigt viser kodestrukturen for dette plugin.", 
  ">The j Plus Subroutine": ">Underrutinen j Plus", 
  ">The j Plus subroutine adds enhanced railroad detail to reports generated by both JMRI and this plugin.": ">Underrutinen j Plus tilføjer forbedrede jernbanedetaljer til rapporter, der genereres af både JMRI og dette plugin.", 
  ">The ops to ops (o2o) subroutine is a group of utilities that are designed to be the glue that allows JMRI Operations Pro to be the operations engine for TrainPlayer©.": ">Underrutinen ops to ops (o2o) er en gruppe af hjælpeprogrammer, der er designet til at være den lim, der gør det muligt for JMRI Operations Pro at være driftsmotor for TrainPlayer©.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file.": ">Mønsterrapporterne og TrainPlayer©-eksporten starter alle med oprettelsen af en JSON-fil.", 
  ">The table below shows which program manages which elements": ">Nedenstående tabel viser, hvilket program der administrerer hvilke elementer", 
  ">These videos are recorded in the English language.": ">Disse videoer er optaget på engelsk.", 
  ">This is railroad that owns or operates the tracks being modeled. Any name can be entered such as 'PRR' or 'BN UPRR Joint' or 'G&D'.": ">Dette er det jernbaneselskab, der ejer eller driver de spor, der modelleres. Der kan indtastes et hvilket som helst navn, f.eks. \"PRR\" eller \"BN UPRR Joint\" eller \"G&D\".", 
  ">This is the railroad's name for the part being modeled, such as 'Long Beach Intermodal Terminal' or 'Salem Glass Works Branch'.": ">Dette er jernbanens navn på den del, der skal modelleres, f.eks. \"Long Beach Intermodal Terminal\" eller \"Salem Glass Works Branch\".", 
  ">Track Pattern Subroutine - Demonstration at a yard</A>": ">Spormønsterunderrutine - Demonstration på en værft</A>", 
  ">Track Pattern Subroutine - Demonstration at industry</A>": ">Spormønsterunderrutine - Demonstration i industrien</A>", 
  ">Track Pattern Subroutine Settings in PatternConfig.json": ">Spore mønster underrutineindstillinger i PatternConfig.json", 
  ">Track Pattern and Switch List JSON format": ">Spormønster og switchliste JSON-format", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include-flag (indstillet af brugeren, skrevet af dette plugin)", 
  ">Translation Services": ">Oversættelsestjenester", 
  ">Translation choice": ">Opgaveoversættelse", 
  ">Tweek Operations, adjustments to operations settings": ">Tweek Drift, justeringer af driftsindstillinger", 
  ">User editable keys are described in green": ">Nøgler, der kan redigeres af brugeren, er beskrevet med grønt", 
  ">Vague Description": ">Vag beskrivelse", 
  ">Where the the railroad is located, such as 'The Great Divide' or 'The Bronx, New York'.": "> Hvor jernbanen er placeret, f.eks. \"The Great Divide\" eller \"The Bronx, New York\".", 
  ">Which year the model railroad is based on, this is a mirror of 'JMRI/OperationsPro/Settings/Year Modeled'.": "> Hvilket år modeljernbanen er baseret på, dette er et spejl af \"JMRI/OperationsPro/Settings/Year Modeled\".", 
  ">Who Does What": ">Hvem gør hvad", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": "> I værste tilfælde skal du blot slette filen Pattern Config.json, og pluginprogrammet opretter en ny.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">Yard Tracks Only-flag (indstillet af brugeren, skrevet af dette plugin)", 
  ">Year Modeled</h4>": ">Modelleret år</h4>", 
  ">j Plus Subroutine": ">j Plus underrutine", 
  ">j Plus Subroutine Settings in PatternConfig.json": ">j Plus Underrutineindstillinger i PatternConfig.json", 
  ">o2o Subroutine Settings in PatternConfig.json": ">o2o Indstillinger for underrutiner i PatternConfig.json", 
  ">o2o Subroutine, ops 2 ops": ">o2o Underrutine, ops 2 ops", 
  ">o2o, the ops to ops subroutine for TrainPlayer©": ">o2o, underrutinen ops til ops for TrainPlayer©", 
  "A template is also included to serve as scaffolding for someone wishing to add their own subroutine.": "Der medfølger også en skabelon, som kan tjene som stillads for dem, der ønsker at tilføje deres egen underrutine.", 
  "Additionally, cars can be moved from track to track within a location.": "Desuden kan biler flyttes fra bane til bane inden for et sted.", 
  "All divisions (written by this plugin)": "Alle divisioner (skrevet af dette plugin)", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Alle JSON-filerne skrives til mappen jsonManifests og følger det illustrerede format:", 
  "Although the subroutines are somewhat interdependent, they may be activated or deactivated individually as needed.": "Selv om underprogrammerne er indbyrdes afhængige, kan de aktiveres eller deaktiveres individuelt efter behov.", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Den findes i mappen \"Operationer\" og bruges til at angive brugerdefinerede indstillinger for hver profil og registrere brugerinput.", 
  "Optionally, if a car is moved onto a spur, the schedule for that spur can be applied.": "Hvis en vogn flyttes til et spor, kan køreplanen for det pågældende spor eventuelt anvendes.", 
  "Plugin location, X axis": "Plugin placering, X-akse", 
  "Plugin location, Y axis": "Plugin placering, Y-akse", 
  "Specify no color with \"\"": "Angiv ingen farve med \"\"", 
  "The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Filen oprettes af dette plugin, og i tilfælde af TrainPlayer©-manifesteksport oprettes JSON-filen ved at ændre den JMRI-genererede manifest-JSON.", 
  "The use of this plugin is documented in the following list of videos.": "Brugen af dette plugin er dokumenteret i følgende liste over videoer.", 
  "This plugin comes with three subroutines; j Plus, Pattern Tracks, and o2o.": "Dette plugin leveres med tre underrutiner; j Plus, Pattern Tracks og o2o."
}