{
  "  The idea is to expand the capability of TrainPlayer©'s Advanced Ops feature to include the flexibility of Operations Pro,": "Die Idee ist, die Möglichkeiten der TrainPlayer©-Funktion Advanced Ops um die Flexibilität von Operations Pro zu erweitern,", 
  "  while also eleminating the tedium of keeping two databases synchronised.": "und gleichzeitig die mühsame Synchronisierung von zwei Datenbanken zu vermeiden.", 
  "> Adjustments to operations settings.": "> Anpassungen der Betriebseinstellungen.", 
  "> Align TrainPlayer and JMRI track types.": "> TrainPlayer- und JMRI-Gleisarten angleichen.", 
  "> JMRI Model Railroad scale.": "> JMRI Modelleisenbahn Maßstab.", 
  "> Names of the TrainPlayer layout export files.": "> Namen der TrainPlayer-Layout-Exportdateien.", 
  ">Activation status": ">Aktivierungsstatus", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Schaltfläche \"Hinzufügen\" zum Panel Pro-Rahmen, Plugin wird nicht angezeigt, ist aber dennoch aktiviert", 
  ">All locations (written by this plugin)": ">Alle Orte (von diesem Plugin geschrieben)", 
  ">Alpha value": ">Alpha-Wert", 
  ">Any of these colors can be changed": ">Jede dieser Farben kann geändert werden", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Flag \"Zeitplan\" anwenden (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Attribute Width": ">Attribut Breite", 
  ">Blue value": ">Blauer Wert", 
  ">Build date from TrainPlayer.": ">Bildungsdatum von TrainPlayer.", 
  ">Bundle Targets, base name for each bundle": ">Bundle-Ziele, Basisname für jedes Bundle", 
  ">Calendar year being modeled.": ">Kalenderjahr, das modelliert wird.", 
  ">Color Definitions": ">Farbdefinitionen", 
  ">Color Palette": ">Farbpalette", 
  ">Control Panel": ">Steuertafel", 
  ">Data for this subroutine is entered into the text boxes or if the TrainPlayer subroutine is activated, the additional railroad detail is imported from the TrainPlayer layout.": ">Die Daten für dieses Unterprogramm werden in die Textfelder eingegeben, oder wenn das TrainPlayer-Unterprogramm aktiviert ist, werden die zusätzlichen Eisenbahndetails aus dem TrainPlayer-Layout importiert.", 
  ">Default encoding": ">Standardkodierung", 
  ">Default panel height": ">Standard-Panelhöhe", 
  ">Default panel width": ">Standard-Panelbreite", 
  ">Destination Track designator": ">Ziel Gleisbezeichner", 
  ">Destination designator": ">Bestimmungskennzeichen", 
  ">Do not edit these": ">Diese nicht bearbeiten", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": ">Jedes JMRI-Profil erhält seine eigene Konfigurationsdatei mit dem Namen PatternConfig.json.", 
  ">Final Destination designator": ">Endzielbezeichnung", 
  ">Final destination Track designator": ">Endziel Gleisbezeichner", 
  ">Green value": ">Grüner Wert", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Hilfe Seite - Pattern Scripts Plugin für JMRI", 
  ">How to add this plugin to JMRI": ">Wie man dieses Plugin zu JMRI hinzufügt", 
  ">How to modify this plugin": ">Wie man dieses Plugin ändert", 
  ">How to set up this plugin</A>": ">So richten Sie dieses Plugin ein</A>", 
  ">How to translate this plugin": ">Wie man dieses Plugin übersetzt", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Track Length Flag ignorieren (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Include list, subroutines are included in this order": ">Include-Liste, Unterprogramme werden in dieser Reihenfolge eingebunden", 
  ">Include this subroutine in the Control Panel": ">Fügen Sie dieses Unterprogramm in die Systemsteuerung ein", 
  ">Introduction": ">Einführung", 
  ">Key": ">Schlüssel", 
  ">Layout Name from JMRI Settings": ">Layout-Name aus JMRI-Einstellungen", 
  ">Layout name, from settings or TrainPlayer.": ">Layout-Name, aus Einstellungen oder TrainPlayer.", 
  ">List of TrainPlayer caboose car codes.": ">Liste der TrainPlayer-Waggoncodes.", 
  ">List of TrainPlayer car codes for passenger cars.": ">Liste der TrainPlayer-Wagencodes für Personenwagen.", 
  ">List of railroad divisions for this layout, comma seperated.": ">Liste der Eisenbahnabteilungen für diese Anlage, kommagetrennt.", 
  ">Location": ">Standort", 
  ">Location of the prototype.": ">Standort des Prototyps.", 
  ">Model railroad scale, from settings or TrainPlayer.": ">Modelleisenbahn-Maßstab, aus den Einstellungen oder TrainPlayer.", 
  ">Model railroad scale.": ">Modelleisenbahn-Maßstab.", 
  ">No color can be specified with \"\"": ">Mit \"\" kann keine Farbe angegeben werden.", 
  ">Not Implemented": ">Nicht implementiert", 
  ">Not all fields need be entered.": ">Es müssen nicht alle Felder ausgefüllt werden.", 
  ">Open System Console Window on starting plugin": ">Öffnen des Systemkonsolenfensters beim Starten des Plugins", 
  ">Operating Railroad Name": ">Betriebsbahnname", 
  ">Operating railroad, the one that owns the tracks.": ">Betreibende Eisenbahn, die Eigentümerin der Gleise.", 
  ">Operational Territory": ">Operatives Territorium", 
  ">Organization": ">Organisation", 
  ">Overview of this plugin": ">Übersicht über dieses Plugin", 
  ">Parent railroad, the one that owns the tracks.": ">Muttergesellschaft, d. h. die Bahn, der die Gleise gehören.", 
  ">Pattern Height": ">Musterhöhe", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (von diesem Plugin geschrieben)", 
  ">Pattern Report for Track Window": ">Musterbericht für Trackfenster", 
  ">Pattern Scripts Subroutine": ">Muster-Skripte Unterroutine", 
  ">Pattern Scripts plugin": ">Plugin für Musterskripte", 
  ">Pattern Scripts plugin - Video Documentation": ">Pattern Scripts-Plugin - Video-Dokumentation", 
  ">Pattern Scripts plugin settings in PatternConfig.json": ">Pattern Scripts Plugin-Einstellungen in PatternConfig.json", 
  ">Pattern Tracks": ">Pattern Tracks", 
  ">Pattern Width": ">Musterbreite", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (geschrieben von diesem Plugin)", 
  ">Plugin Layout": ">Plugin-Layout", 
  ">Railroad Details, optional part of the TrainPlayer layout.": ">Eisenbahndetails, optionaler Teil des TrainPlayer-Layouts.", 
  ">Red value": ">Roter Wert", 
  ">Report Modifiers": ">Modifikatoren für Berichte", 
  ">Reserved": ">Reserviert", 
  ">Revision control": ">Revisionskontrolle", 
  ">Row Multiplier": ">Reihenmultiplikator", 
  ">Script Includes": ">Skript Enthält", 
  ">Sort Cars": ">Autos sortieren", 
  ">Sort Locomotives": ">Lokomotiven sortieren", 
  ">Subroutine Panel": ">Unterprogramm-Panel", 
  ">Subroutines - Video Documentation": ">Unterprogramme - Video-Dokumentation", 
  ">Territory. Name of the particular operation being modeled.": ">Territorium: Name des jeweiligen Vorgangs, der modelliert wird.", 
  ">The Pattern Scripts plugin can be thought of as a framework for hosting subroutines for JMRI Operations Pro that require a user interface.": ">Das Plugin \"Pattern Scripts\" kann als Rahmen für die Aufnahme von Unterprogrammen für JMRI Operations Pro betrachtet werden, die eine Benutzeroberfläche benötigen.", 
  ">The Pattern Scripts plugin for JMRI is a suite of subroutines for JMRI Operations Pro.": ">Das Plugin \"Pattern Scripts\" für JMRI ist eine Sammlung von Unterprogrammen für JMRI Operations Pro.", 
  ">The Track Pattern subroutine can generate pattern reports for tracks at a single location.": ">Das Unterprogramm \"Track Pattern\" kann Pattern-Berichte für Tracks an einem einzigen Ort erstellen.", 
  ">The description of each element is in blue": ">Die Beschreibung der einzelnen Elemente ist blau.", 
  ">The enhanced fields are as follows:": ">Die erweiterten Felder sind wie folgt:", 
  ">The following chart shows the code structure of this plugin.": ">Die folgende Tabelle zeigt die Codestruktur dieses Plugins.", 
  ">The j Plus Subroutine": ">Das Unterprogramm j Plus", 
  ">The j Plus subroutine adds enhanced railroad detail to reports generated by both JMRI and this plugin.": ">Das Unterprogramm j Plus fügt den Berichten, die sowohl von JMRI als auch von diesem Plugin erstellt werden, erweiterte Eisenbahndetails hinzu.", 
  ">The ops to ops (o2o) subroutine is a group of utilities that are designed to be the glue that allows JMRI Operations Pro to be the operations engine for TrainPlayer©.": ">Die Unterroutine ops to ops (o2o) ist eine Gruppe von Hilfsprogrammen, die JMRI Operations Pro als Operations-Engine für TrainPlayer© dienen.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file.": ">Die Musterberichte und TrainPlayer©-Exporte beginnen alle mit der Erstellung einer JSON-Datei.", 
  ">The table below shows which program manages which elements": ">Die folgende Tabelle zeigt, welches Programm welche Elemente verwaltet", 
  ">These videos are recorded in the English language.": ">Diese Videos sind in englischer Sprache aufgenommen.", 
  ">This is railroad that owns or operates the tracks being modeled. Any name can be entered such as 'PRR' or 'BN UPRR Joint' or 'G&D'.": ">Dies ist die Bahngesellschaft, die die zu modellierenden Gleise besitzt oder betreibt. Es kann ein beliebiger Name eingegeben werden, z. B. 'PRR' oder 'BN UPRR Joint' oder 'G&D'.", 
  ">This is the railroad's name for the part being modeled, such as 'Long Beach Intermodal Terminal' or 'Salem Glass Works Branch'.": ">Dies ist der Name der Bahngesellschaft für den zu modellierenden Teil, z. B. \"Long Beach Intermodal Terminal\" oder \"Salem Glass Works Branch\".", 
  ">Track Pattern Subroutine - Demonstration at a yard</A>": ">Track Pattern Subroutine - Demonstration auf einer Werft</A>", 
  ">Track Pattern Subroutine - Demonstration at industry</A>": ">Track Pattern Subroutine - Demonstration in der Industrie</A>", 
  ">Track Pattern Subroutine Settings in PatternConfig.json": ">Track Pattern Subroutine Einstellungen in PatternConfig.json", 
  ">Track Pattern and Switch List JSON format": ">Track Pattern und Switch List JSON-Format", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Translation Services": ">Übersetzungsdienstleistungen", 
  ">Translation choice": ">Übersetzungsauswahl", 
  ">Tweek Operations, adjustments to operations settings": ">Wochenbetrieb, Anpassungen der Betriebseinstellungen", 
  ">User editable keys are described in green": ">Vom Benutzer bearbeitbare Tasten sind in grün beschrieben.", 
  ">Vague Description": ">Vage Beschreibung", 
  ">Where the the railroad is located, such as 'The Great Divide' or 'The Bronx, New York'.": ">Der Ort, an dem sich die Bahnlinie befindet, z. B. \"The Great Divide\" oder \"The Bronx, New York\".", 
  ">Which year the model railroad is based on, this is a mirror of 'JMRI/OperationsPro/Settings/Year Modeled'.": ">Welches Jahr der Modelleisenbahn zugrunde liegt, ist eine Spiegelung von 'JMRI/OperationsPro/Einstellungen/Jahr modelliert'.", 
  ">Who Does What": ">Wer macht was", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Im schlimmsten Fall löschen Sie einfach die Datei \"Pattern Config.json\" und das Plugin erstellt eine neue Datei.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">Flagge \"Nur Yard Tracks\" (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Year Modeled</h4>": ">Jahr des Modells</h4>", 
  ">j Plus Subroutine": ">j Plus Unterroutine", 
  ">j Plus Subroutine Settings in PatternConfig.json": ">j Plus Subroutine Einstellungen in PatternConfig.json", 
  ">o2o Subroutine Settings in PatternConfig.json": ">o2o Einstellungen der Unterroutine in PatternConfig.json", 
  ">o2o Subroutine, ops 2 ops": ">o2o Unterprogramm, ops 2 ops", 
  ">o2o, the ops to ops subroutine for TrainPlayer©": ">o2o, die Unterroutine ops to ops für TrainPlayer©", 
  "A template is also included to serve as scaffolding for someone wishing to add their own subroutine.": "Es ist auch eine Vorlage enthalten, die als Gerüst für jemanden dient, der sein eigenes Unterprogramm hinzufügen möchte.", 
  "Additionally, cars can be moved from track to track within a location.": "Außerdem können die Fahrzeuge innerhalb eines Ortes von einem Gleis zum anderen bewegt werden.", 
  "All divisions (written by this plugin)": "Alle Abteilungen (geschrieben von diesem Plugin)", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Alle JSON-Dateien werden in den Ordner jsonManifests geschrieben und folgen dem abgebildeten Format:", 
  "Although the subroutines are somewhat interdependent, they may be activated or deactivated individually as needed.": "Obwohl die Unterprogramme in gewisser Weise voneinander abhängig sind, können sie je nach Bedarf einzeln aktiviert oder deaktiviert werden.", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Es befindet sich im Ordner \"Operationen\" und wird verwendet, um benutzerdefinierte Einstellungen für jedes Profil vorzunehmen und Benutzereingaben aufzuzeichnen.", 
  "Optionally, if a car is moved onto a spur, the schedule for that spur can be applied.": "Wird ein Wagen auf eine Stichstrecke verschoben, kann optional der Fahrplan für diese Stichstrecke angewendet werden.", 
  "Plugin location, X axis": "Standort des Plugins, X-Achse", 
  "Plugin location, Y axis": "Standort des Plugins, Y-Achse", 
  "Specify no color with \"\"": "Keine Farbe mit \"\" angeben", 
  "The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Die Datei wird von diesem Plugin erstellt und im Falle von TrainPlayer©-Manifestexporten wird das JSON durch Modifizierung des von JMRI generierten Manifest-JSON erstellt.", 
  "The use of this plugin is documented in the following list of videos.": "Die Verwendung dieses Plugins ist in der folgenden Liste von Videos dokumentiert.", 
  "This plugin comes with three subroutines; j Plus, Pattern Tracks, and o2o.": "Dieses Plugin verfügt über drei Unterprogramme: j Plus, Pattern Tracks und o2o."
}