{
  "  Additionally, cars can be moved from track to track within a location,": "Außerdem können die Fahrzeuge innerhalb eines Ortes von einem Gleis zum anderen bewegt werden,", 
  "  The idea is to expand the capability of TrainPlayer©'s Advanced Ops feature to include the operational flexibility of Operations Pro,": "Die Idee ist, die Möglichkeiten der TrainPlayer©-Funktion Advanced Ops um die betriebliche Flexibilität von Operations Pro zu erweitern,", 
  "  and optionally, if a car is moved onto a spur, the schedule for that spur can be applied.>Track Pattern and Switch List JSON format": "und optional kann der Fahrplan für eine Spur angewendet werden, wenn ein Wagen auf eine Spur verschoben wird.>Track Pattern and Switch List JSON format", 
  "  while also eleminating the tedium of keeping two databases synchronised.": "und gleichzeitig die mühsame Synchronisierung von zwei Datenbanken zu vermeiden.", 
  "> Adjustments to operations settings.": "> Anpassungen der Betriebseinstellungen.", 
  "> Align TrainPlayer and JMRI track types.": "> TrainPlayer- und JMRI-Gleisarten angleichen.", 
  "> JMRI Model Railroad scale.": "> JMRI Modelleisenbahn Maßstab.", 
  "> Names of the TrainPlayer layout export files.": "> Namen der TrainPlayer-Layout-Exportdateien.", 
  ">Add button to Panel Pro frame, plugin is not displayed but still enabled": ">Schaltfläche \"Hinzufügen\" zum Panel Pro-Rahmen, Plugin wird nicht angezeigt, ist aber dennoch aktiviert", 
  ">All Locations (written by this plugin)": ">Alle Standorte (von diesem Plugin geschrieben)", 
  ">Alpha value": ">Alpha-Wert", 
  ">Any of these colors can be changed": ">Jede dieser Farben kann geändert werden", 
  ">Apply Schedule flag (set by user, written by this plugin)": ">Flag \"Zeitplan\" anwenden (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Attribute Width": ">Attribut Breite", 
  ">Blue value": ">Blauer Wert", 
  ">Bundle Targets, base name for each bundle": ">Bundle-Ziele, Basisname für jedes Bundle", 
  ">Color Definitions": ">Farbdefinitionen", 
  ">Color Palett": ">Farbpalette", 
  ">Control Panel": ">Steuertafel", 
  ">Default encoding": ">Standardkodierung", 
  ">Default panel height": ">Standard-Panelhöhe", 
  ">Default panel width": ">Standard-Panelbreite", 
  ">Destination Track designator": ">Ziel Gleisbezeichner", 
  ">Destination designator": ">Bestimmungskennzeichen", 
  ">Do not edit these": ">Diese nicht bearbeiten", 
  ">Each JMRI profile gets its own configuration file, which is named PatternConfig.json.": ">Jedes JMRI-Profil erhält seine eigene Konfigurationsdatei mit dem Namen PatternConfig.json.", 
  ">Final Destination designator": ">Endzielbezeichnung", 
  ">Final destination Track designator": ">Endziel Gleisbezeichner", 
  ">Green value": ">Grüner Wert", 
  ">Guard rails of sorts have been put up around the values marked in green, but even so this plugin is not able to catch every type of mistake.": ">Um die grün markierten Werte wurde eine Art Schutzleiste gelegt, aber auch so kann dieses Plugin nicht jeden Fehler abfangen.", 
  ">Help Page - Pattern Scripts plugin for JMRI": ">Hilfe Seite - Pattern Scripts Plugin für JMRI", 
  ">How to add this plugin to JMRI": ">Wie man dieses Plugin zu JMRI hinzufügt", 
  ">How to modify this plugin": ">Wie man dieses Plugin verändert", 
  ">How to set up this plugin</A>": ">So richten Sie dieses Plugin ein</A>", 
  ">How to translate this plugin": ">Wie man dieses Plugin übersetzt", 
  ">Ignore Track Length flag (set by user, written by this plugin)": ">Track Length Flag ignorieren (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Include this subroutine in the Control Panel": ">Fügen Sie dieses Unterprogramm in die Systemsteuerung ein", 
  ">Introduction": ">Einführung", 
  ">Key": ">Schlüssel", 
  ">List of TrainPlayer caboose car codes.": ">Liste der TrainPlayer-Wagencodes.", 
  ">List of TrainPlayer car codes for passenger cars.": ">Liste der TrainPlayer-Wagencodes für Personenwagen.", 
  ">No color can be specified with \"\"": ">Mit \"\" kann keine Farbe angegeben werden.", 
  ">Not Implemented": ">Nicht implementiert", 
  ">Open System Console Window": ">Systemkonsolenfenster öffnen", 
  ">Organization": ">Organisation", 
  ">Pattern Height": ">Musterhöhe", 
  ">Pattern Location (written by this plugin)": ">Pattern Location (von diesem Plugin geschrieben)", 
  ">Pattern Report for Track Window": ">Musterbericht für Trackfenster", 
  ">Pattern Scripts Subroutine": ">Muster-Skripte Unterroutine", 
  ">Pattern Tracks": ">Pattern Tracks", 
  ">Pattern Width": ">Musterbreite", 
  ">Pattern-Tracks (written by this plugin)": ">Pattern-Tracks (geschrieben von diesem Plugin)", 
  ">Plugin Layout": ">Plugin-Layout", 
  ">Red value": ">Roter Wert", 
  ">Report Modifiers": ">Modifikatoren für Berichte", 
  ">Revision control": ">Revisionskontrolle", 
  ">Row Multiplier": ">Reihenmultiplikator", 
  ">Script Includes": ">Skript Enthält", 
  ">Sort Cars": ">Autos sortieren", 
  ">Sort Locomotives": ">Lokomotiven sortieren", 
  ">The Pattern Scripts plugin for JMRI is a suite of subroutines for JMRI Operations Pro.  The use of this plugin is documented in the following list of videos.": ">Das Plugin Pattern Scripts für JMRI ist eine Reihe von Unterprogrammen für JMRI Operations Pro. Die Verwendung dieses Plugins ist in der folgenden Liste von Videos dokumentiert.", 
  ">The Track Pattern subroutine can generate pattern reports for tracks at a single location.": ">Das Unterprogramm \"Track Pattern\" kann Pattern-Berichte für Tracks an einem einzigen Ort erstellen.", 
  ">The description of each element is in blue": ">Die Beschreibung der einzelnen Elemente ist blau.", 
  ">The following chart shows the code structure of this plugin.": ">Die folgende Tabelle zeigt die Codestruktur dieses Plugins.", 
  ">The ops to ops (o2o) subroutine is a group of utilities that are designed to be the glue that allows JMRI Operations Pro to be the operations engine for TrainPlayer©.": ">Die Unterroutine ops to ops (o2o) ist eine Gruppe von Hilfsprogrammen, die JMRI Operations Pro als Operations-Engine für TrainPlayer© dienen.", 
  ">The pattern reports and TrainPlayer© exports all start with the creation of a JSON file.": ">Die Musterberichte und TrainPlayer©-Exporte beginnen alle mit der Erstellung einer JSON-Datei.", 
  ">These videos are recorded in the English language.": ">Diese Videos sind in englischer Sprache aufgenommen.", 
  ">Track Pattern Subroutine - Demonstration at a yard</A>": ">Track Pattern Subroutine - Demonstration auf einer Werft</A>", 
  ">Track Pattern Subroutine - Demonstration at industry</A>": ">Track Pattern Subroutine - Demonstration in der Industrie</A>", 
  ">TrainPlayer Include flag (set by user, written by this plugin)": ">TrainPlayer Include flag (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">Translation Choice": ">Übersetzungsauswahl", 
  ">Translation Services": ">Übersetzungsdienstleistungen", 
  ">User editable keys are described in green": ">Vom Benutzer bearbeitbare Tasten sind in grüner Farbe beschrieben.", 
  ">Vague Description": ">Vage Beschreibung", 
  ">Video Documentation": ">Video-Dokumentation", 
  ">Worst case, simply delete the Pattern Config.json file and the plugin will create a new one.": ">Im schlimmsten Fall löschen Sie einfach die Datei \"Pattern Config.json\" und das Plugin erstellt eine neue Datei.", 
  ">Yard Tracks Only flag (set by user, written by this plugin)": ">Flagge \"Nur Yard Tracks\" (vom Benutzer gesetzt, von diesem Plugin geschrieben)", 
  ">j Plus Subroutine": ">j Plus Unterroutine", 
  ">o2o Subroutine, ops 2 ops": ">o2o Unterprogramm, ops 2 ops", 
  ">o2o, the ops to ops subroutine for TrainPlayer©": ">o2o, die Unterroutine ops to ops für TrainPlayer©", 
  "All the JSON files are written to the jsonManifests folder. They follow the illustrated format:": "Alle JSON-Dateien werden in den Ordner jsonManifests geschrieben und folgen dem abgebildeten Format:", 
  "In other cases, if a mistake is made editing the PatternConfig.json file, the plugin will replace it with the default file, and the user will have to start over.": "In anderen Fällen, wenn ein Fehler bei der Bearbeitung der Datei PatternConfig.json gemacht wird, ersetzt das Plugin diese durch die Standarddatei, und der Benutzer muss von vorne beginnen.", 
  "In some cases the plugin might crash. If that happens, press the 'Restart from PatternConfig Backup\" button and the plugin will use the last good PatternConfig.json file as a new starting off point.": "In einigen Fällen kann das Plugin abstürzen. Wenn das passiert, drücken Sie die Schaltfläche 'Restart from PatternConfig Backup' und das Plugin wird die letzte gute PatternConfig.json-Datei als neuen Startpunkt verwenden.", 
  "It is found in the operations folder, and is used to provide custom settings for each profile and record user inputs.": "Es befindet sich im Ordner \"Operationen\" und wird verwendet, um benutzerdefinierte Einstellungen für jedes Profil vorzunehmen und Benutzereingaben aufzuzeichnen.", 
  "The file is created by this plugin and in the case of TrainPlayer© manifest exports the JSON is created by modifying the JMRI generated manifest JSON.": "Die Datei wird von diesem Plugin erstellt und im Falle von TrainPlayer©-Manifestexporten wird das JSON durch Modifizierung des von JMRI generierten Manifest-JSON erstellt."
}